Repository: InternationalIDEA/ERMT
Catalog: Idea.ERMT/Idea.Facade/General.*.resx
Languages: ar, es_es, fr, my, ru, th

# ModelImportErrorVersionUsesDundasAndWrongParent
source: The version of the exported model is old and the model is not a COUNTRY level model. We're unable to import such models.
ar: نسخة النموذج المراد تصديره قديمة كما أنه ليس على مستوى بلد. لا يمكن استيراد هذا النوع من النموذج.
es_es: La versión del modelo exportado es vieja y el model no es de nivel PAIS. No es posible importar.
fr: La version du modèle importée est dépassée et le modèle n'est pas un modèle pays. Ces modèles ne peuvent pas être importés.
my: Export ျပဳလုပ္ထားေသာ Model ၏ Version မွာ အေဟာင္းျဖစ္ေနျပီး Model သည္လည္း ႏုိင္ငံအဆင့္ Model တစ္ခုမဟုတ္ပါ။ အဆုိပါ Model မ်ားအား Import ျပဳလုပ္၍မရပါ။
ru: Версия экспортированной модели стара и данная модель не соответствует модели Странового уровня. Невозможно импортировать такие модели.
th: เวอร์ชั่นของ Model ที่ส่งออก เก่าเกินไป แผนที่ที่ใช้ไม่ใช่ข้อมูลในระดับประเทศ จึงไม่สามารถนำเข้า Model ดังกล่าวได้

# PasteOnEmptyTable
source: Please add rows to the table before pasting.
ar: يرجى اظافة أسطر للجدول قبل اظافة البيانات.
es_es: Por favor agregar filas a la tabla antes de pegar.
fr: Ajouter des lignes au tableau avant de coller
my: Paste မလုပ္မီတြင္ ဇယားအတြင္း၌ Row တစ္ခုအား အရင္ Add လုပ္ပါ။
ru: Пожалуйста, добавьте ряды в таблицы перед вставкой.
th: โปรดเพิ่มแถวสำหรับ ตารางข้อมูล (Table) ก่อนที่จะคัดลอกแล้วนำไปวาง

# RegionChildsWithModelsDeleteConfirm
source: There are models using the regions you're about to delete. If you continue, those models will be deleted too. Do you want to continue?
ar: يتم استخدام المنطقة أو احد فروعها من قبل نماذج أخرى. سيتم حذف النماذج في حال حذف المنطقة. هل ترغب بالمتابعة.
es_es: Existen modelos utilizando las regiones que se van a eliminar. Si continua, esos modelos serán borrados también. Desea continuar?
fr: Des modèles en vigueur utilisent les régions que vous voulez supprimer. Si vous continuez, ces modèles seront également supprimées. Continuer ?
my: သင္ Delete လုပ္ေတာ့မည့္ ေဒသမ်ားအား အသုံးျပဳေနေသာ အျခား Model မ်ားရွိပါသည္။ ၎ေဒသမ်ားကုိ Delete လုပ္လုိက္ပါက အဆုိပါ Model မ်ားလည္း ပ်က္စီသြားမည္ျဖစ္သည္။ ဆက္လက္ေဆာင္ရြက္လုိပါသလား။
ru: Есть модели, использующие регионы, которые вы собираетесь удалить. Если вы продолжите, эти модели будут также удалены. Хотите продолжить?
th: มี Model ที่ใช้งานแผนที่นี้อยู่ ท่านต้องการที่จะลบแผนที่หรือไม่ หากท่านลบ Model ที่ใช้งานแผนที่นี้ก็จะถูกลบไปด้วย ท่านต้องการดำเนินการต่อไปหรือไม่

# TableByRegionPasteOverwriteWarning
source: If the data you are pasting contains dates that already exist, the existing information will be overwritten. If not, new rows will be added. Do you want to continue?
ar: في حال تضمنت البيانات المظافة تواريخ موجودة من قبل, فإنها ستحل محل المعلومات القديمة . أذا لم يكن هذا هو الحال, سيتم اظافة أسطر جديدة. هل ترغب في المواصلة.
es_es: Si la información que se está pegando contiene fechas que ya existen, la información será sobreescrita. Desea continuar?
fr: Si les données que vous collez contiennent des données qui existent déjà, les informations existantes seront perdues. Si non, des nouvelles lignes seront ajoutées. Continuer ?
my: သင္ Paste လုပ္ေတာ့မည့္ Data မ်ားထဲတြင္ မူလက တည္ရွိျပီးသား ရက္စြဲမ်ား ပါ၀င္ပါက သင္ Paste လုပ္လုိက္မည္ဆုိလွ်င္ နဂုိရွိျပီးသားရက္စြဲမ်ား ေပ်ာက္ပ်က္သြားမည္ျဖစ္သည္။ မပါ၀င္ပါက Row အသစ္မ်ား ေပၚေပါက္လာမည္ျဖစ္သည္။ ဆက္လက္ေဆာင္ရြက္လုိပါသလား။
ru: Если данные, которые вы вставляете содержат данные, которые уже сещуствуют, существующая информация будет перезаписана. Если нет, то новые ряды будут добавлены. Хотите продолжить?
th: ถ้าข้อมูลที่ท่านคัดลอกมาตรงกับวันที่ที่มีอยู่แล้ว ข้อมูลเดิมจะถูกแทนที่ด้วยข้อมูลใหม่ ถ้าข้อมูลที่คัดลอกมา วันที่ไม่ตรงกับข้อมูลเดิมที่มีอยู่แล้ว ข้อมูลจะถูกนำไปต่อท้ายตารางข้อมูล (Table) ท่านต้องการที่จะดำเนินการต่อหรือไม่

# ContactBody
source: Your details (name and contact): %0D%0A%0D%0A Comment is about (tool material, functionality, tool performance, your general experience, other): %0D%0A%0D%0A Your comment:
ar: بياناتكم (الإسم و جهة الإتصال): %0D%0A%0D%0A التعليق بخصوص (بيانات الأداة، الوظائف، آداء الأداة، التجربة العامة): %0D%0A%0D%0A تعليقك
es_es: Sus detalles (nombre y contacto): %0D%0A%0D%0A El comentario es acerca de (material de la herramienta, funcionalidad, performance, experiencia general, otro): %0D%0A%0D%0A Su comentario:
fr: Vos coordonnées (nom et contact):% 0D% 0A% 0D% 0A Commentaire est à propos de (matériel de référence de l'outil, fonctionnalité, performance de l'outil, vos expériences, etc.):% 0D% 0A% 0D% 0A Votre commentaire:
my: သင္၏ အခ်က္အလက္မ်ား (အမည္ႏွင့္ အဆက္အသြယ္): %0D%0A%0D%0A မွတ္ခ်က္သည္ (tool ၏ ေဆာင္ရြက္ပုံ၊ လုပ္ေဆာင္ခ်က္၊ သင္၏ ေယဘုယ်အေတြ႕အၾကံဳ၊ အျခား) အေၾကာင္းျဖစ္သည္။: %0D%0A%0D%0A သင္၏မွတ္ခ်က္
ru: Ваши детали (имя и контакты): %0D%0A%0D%0A Комментарий о (инструментальный материал, функциональность, производительность инструмента, ваш общий опыт, другое): %0D%0A%0D%0A Ваш комментарий:
th: รายละเอียดเกี่ยวกับตัวท่าน (ชื่อและที่อยู่) : %0D%0A%0D%0A คำแนะนำ(เกี่ยวกับเครื่องมือการทำงานและประสิทธิภาพการใช้งาน ประสบการณ์ และอื่น ๆ) : %0D%0A%0D%0A คำแนะนำของท่าน :

# ContactSubject
source: Comments - Electoral Risk Management Tool
ar: تعليقات - أداة رصد المخاطر الإنتخابية
es_es: Comentarios - Electoral Risk Management Tool
fr: Commentaires - Outil de gestion des risques électoraux
my: မွတ္ခ်က္မ်ား - Elecrtoral Risk Management Tool
ru: Комментарии: Инструмент Управления Электоральными Рисками
th: คำแนะนำและข้อเสนอแนะเกี่ยวกับ - Elecrtoral Risk Management Tool

source: Add
ar: إظافة
es_es: Agregar
fr: Ajouter
my: ထည့္သြင္းသည္။ (Add)
ru: Добавить
th: เพิ่ม (Add)

source: Alert
ar: تنبيه
es_es: Alerta
fr: Alerte
ru: Сигнал
th: การแจ้งเตือน (Alert)

source: Created
ar: تم انشاؤه
es_es: Creado
fr: Créé
my: ဖန္တီးထားသည္။
ru: Создан
th: สร้าง

# CurrentModelReorderFactors
source: Reorder factors of current model
ar: إعادة ترتيب عوامل النموذج
es_es: Reordenar los factores del modelo actual
fr: Réorganiser les facteurs du modèle actuel
my: လက္ရွိ Model ၏ Factor မ်ားအား အစဥ္လုိက္ျပန္စီသည္။
ru: Упорядочить факторы текущей модели
th: เรียงลำดับ Factor ของ Model ที่กำลังใช้งานอยู่ในขณะนี้

source: Modified
ar: تعديل
es_es: Modificado
fr: Modifié
my: ျပင္ဆင္ထားသည္။
ru: Изменены
th: การแก้ไข เปลี่ยนเปลี่ยน

source: Risk Alert Search
ar: بحث في تنبيه المخاطر
es_es: Riesgo y Alerta
fr: Rechercher les alertes de risque
my: Risk Alert အား ရွာေဖြသည္။
ru: Поиск Сигнала Риска
th: ค้นหา Risk Alert

# RiskAndActionDateFrom
source: You must select a Date From
ar: يجب تحديد تاريخ البداية
es_es: Por favor seleccione fecha desde
fr: Sélectionner une date à partir de
my: Date from တစ္ခု ေရြးခ်ယ္ရမည္။
ru: Необходимо выбрать Дату от
th: เลือกวันที่ เริ่มต้น Date from

# RiskAndActionDateTo
source: You must select a Date To
ar: يجب تحديد تاريخ النهاية
es_es: Por favor seleccione fecha hasta
fr: Sélectionner une date jusqu'à
my: Date to တစ္ခု ေရြးခ်ယ္ရမည္။
ru: Необходимо выбрать Дату по
th: เลือกวันที่สิ้นสุด Date to

# RiskAndActionPhase
source: You must select at least one Phase
ar: يجب تحديد مرحلة انتخابية واحدة على الأقل
es_es: Por favor seleccione una fase
fr: Sélectionner au moins une phase
my: Phase တစ္ခုေတာ့ အနည္းဆုံး ေရြးခ်ယ္ရမည္။
ru: Необходимо выбрать хотя бы одну Фазу
th: เลือกข้อความอย่างน้อย 1 ข้อความ

# RiskAndActionRegion
source: You must select at least one Region
ar: يجي تحديد منطقة واحدة على الأقل
es_es: Por favor seleccione una región
fr: Sélectionner au moins une région
my: ေဒသတစ္ခုေတာ့ အနည္းဆုံး ေရြးခ်ယ္ရမည္။
ru: Необходимо выбрать хотя бы один Регион
th: เลือกแผนที่อย่างน้อย 1 ระดับ

# RiskAndActionSaveWarning
source: Please save to enable adding attachments.
ar: يرجى الحفظ حتى يتسنى اظافة المرفقات
es_es: Por favor guardar antes de agregar adjuntos.
fr: Enregistrer pour pouvoir ajouter des pièces jointes
my: Attachment မ်ားထည့္သြင္းႏုိင္ရန္အတြက္ Save လုပ္ပါ။
ru: Пожалуйста, сохраните для возможности прикрепить вложения
th: โปรดบันทึกไปยัง เอกสารแนบ(Attachment) ที่สามารถ Add เพิ่มได้

# HTMLWarningText
source: Must Select Text from which to create a Link to a Document.
ar: يجب تحديد النص من حيث تريد إنشاء ارتباط إلى وثيقة.
fr: Doit Sélectionnez Texte à partir duquel créer un lien vers un document.

# HTMLWarningTitle
source: Insert link
ar: إدراج رابط
fr: Insérer le lien

source: Large
ar: كبير
fr: Grand

# MarkerTypeSelectImage
source: Load an image file
ar: تحميل ملف صورة
fr: Charger un fichier image

source: Medium
ar: متوسط
fr: Moyen

source: Small
ar: صغير
fr: Petit

# CancelText
source: Cancel
ar: إلغاء
fr: Annuler

source: Date
ar: موعد

# OKText
source: OK
ar: حسنا

source: Resultant value of:
ar: : للقيمة المحصلة للمناطق
fr: Valeur résultante des régions:
