Repository: InternationalIDEA/ERMT
Catalog: Idea.ERMT/Idea.Facade/General.*.resx
Languages: ar, es_es, fr, my, ru, th

# UserValidateLastName
source: Last name is required.
ar: اللقب العائلي ضروري
es_es: El apellido es requerido.
fr: Nom nécessaire
my: Last Name လုိအပ္သည္။
ru: Необходимо ввести фамилию
th: ต้องใส่ Last Name

# UserValidatePass
source: Password is required.
ar: كلمة السر ضرورية
es_es: La contraseña es requerida.
fr: MdP nécessaire
my: Password လုိအပ္သည္။
ru: Необходимо ввести пароль
th: ต้องใส่ Password

# UserValidatePassMatch
source: Passwords do not match.
ar: لا يوجد تطابق في كلمة السر
es_es: La contraseña no coincide.
fr: Les MdP ne correspondent pas
my: Password မ်ား ကုိက္ညီမႈ မရွိပါ။
ru: Пароль не подходит
th: Password ไม่ถูกต้อง

# UserValidateRole
source: Role is required.
ar: الدور ضروري
es_es: El rol es requerido.
fr: Rôle est nécessaire.
my: Role လုိအပ္သည္။
ru: Необходимо выбрать Роль
th: ต้องการหน้าที่ (Role)

# UserValidateUsername
source: Username is required.
ar: اسم المستخدم ضروري
es_es: El nombre de usuario es requerido,
fr: Le nom d'utilisateur est requis,
my: Username လုိအပ္သည္။
ru: Необходимо ввести Имя пользователя
th: ต้องการ Username

source: Action
ar: اجراء
es_es: Acción.
fr: Mesures
my: ေဆာင္ရြက္ပါ။ (Action)
ru: Действие
th: การดำเนินการแก้ไขปัญหา (Action)

source: Active
ar: غير فاعل
es_es: Activo
fr: Actif
my: ေဆာင္ရြက္ေနသည္။ (Active)
ru: Активный
th: เหตุการณ์ยังคงอยู่(Active)

source: Analysis
ar: تحليل
es_es: Análisis
fr: Analyse
my: သရုပ္ခြဲေလ့လာမႈ (Analysis)
ru: Анализ
th: การวิเคราะห์ (Analysis)

source: Code
ar: كود
es_es: Código
my: လွ်ိဳ႕၀ွက္ဂဏန္း (Code)
ru: Код
th: รหัส(Code)

source: Date From
ar: تاريخ البداية
es_es: Fecha desde
fr: Date à partir de
my: ဤေန႔ရက္မွ (Date From)
ru: Дата от
th: วันที่เริ่มต้น (Date From)

source: Date To
ar: تاريخ النهاية
es_es: Fecha hasta
fr: Date jusqu'à
my: ဤေန႔ရက္သုိ႔ (Date To)
ru: Дата до
th: วันที่สิ้นสุด (Date To)

source: Inactive
ar: فاعل
es_es: Inactivo
fr: Inactif
my: ေဆာင္ရြက္ျခင္းမရွိပါ။ (Inactive)
ru: Неактивный
th: เหตุการณ์ยุติแล้ว (Inactive)

source: Model
ar: نموذج
es_es: Modelo
fr: Modèle
my: ပုံစံ (Model)
ru: Модель
th: ตัวแบบ (Model)

source: Phases
ar: المرحلة الإنتخابية
es_es: Fases
my: အဆင့္မ်ား (Phases)
ru: Фазы
th: ข้อความ (Phases)

source: Regions
ar: المنطقة
es_es: Regiones
fr: Régions
my: ေဒသမ်ား (Regions)
ru: Регионы
th: แผนที่ (Regions)

source: Result
ar: نتيجة
es_es: Resultado
fr: Résultats
my: ရလဒ္ (Result)
ru: Результат
th: ผลลัพท์ (Result)

source: Risk Description
ar: وصف المخاطر
es_es: Descripción de riesgo
fr: Description de risque
my: Risk အေၾကာင္းေဖၚျပခ်က္ (Risk Description)
ru: Описание Риска
th: รายละเอียดปัจจัยเสี่ยง (Risk Description)

source: Status
ar: الحالة
es_es: Estado
fr: Etat
my: အေျခအေန
ru: Статус
th: สถานะ

source: Title
ar: العنوان
es_es: Título
fr: Titre
my: ေခါင္းစဥ္ (Title)
ru: Название
th: หัวข้อ (Title)

source: Cumulative
ar: تراكمي
es_es: Acumulativo
fr: Cumulatif
my: စုပုံေနေသာ (Cumulative)
ru: Кумулятивный
th: จำนวนนับ (Cumulative)

# ModelAddTitle
source: Add model
ar: إظافة نموذج
es_es: Agregar modelo
fr: Ajouter modèle
my: Model ထည့္သြင္းပါ။ (Add Model)
ru: Добавить модель
th: เพิ่ม Model

source: World
ar: العالم
es_es: Mundo
fr: Monde
my: ကမၻာ
ru: Мир
th: แผนที่โลก

# PreviewTitle
source: Preview
ar: نظرة عامة
es_es: Vista previa
fr: Afficher
my: အစမ္းၾကည့္ရႈသည္။ (Preview)
ru: Предварительный просмотр
th: ดู (Preview)

source: Electoral Cycle
ar: الدورة الإنتخابية
es_es: Ciclo Electoral
fr: Cycle électoral
my: ေရြးေကာက္ပြဲစက္၀န္း (Electoral Cycle)
ru: Электоральный Цикл
th: วงจรการเลือกตั้ง (Electoral Cycle)

source: Knowledge Resources
ar: مصادر المعرفة
es_es: Recursos de Conocimiento
fr: Base de connaissances
my: အသိပညာေပးအရင္းအျမစ္မ်ား (Knowledge Resources)
ru: Ресурсы Знаний
th: ฐานข้อมูล (Knowledge Resources)

# ModelEdit
source: Edit model
ar: تعديل نموذج
es_es: Editar modelo
fr: Modifier modèle
my: Model အား Edit ျပဳလုပ္ပါ။
ru: Редактировать модель
th: แก้ไข Model

# RiskAndActionTitle
source: Risk and Action
ar: المخاطر و الإجراءات
es_es: Riesgo y acción
fr: Risques et actions
my: Risk ႏွင့္ အေရးယူေဆာင္ရြက္မႈ (Risk and Action)
ru: Риск и Действие
th: ปัจจัยเสี่ยงและการแก้ไข (Risk and Action)

# BackupText
source: Backup successfully saved.
ar: تم حفظ النسخ الإحتياطي
es_es: El backup fue satisfactoriamente guardado.
fr: Sauvegarde enregistré
my: Backup အား ေအာင္ျမင္စြာ Save လုပ္ျပီးပါျပီ။
ru: Резервная копия успешно сохранена
th: Backup สำเร็จ

# BackupCancel
source: Backup canceled
ar: تم الغاء النسخ الاحتياطي
es_es: El backup fue cancelado.
fr: Sauvegarde annulé
my: Backup အား Cancel လုပ္ျပီးပါျပီ။
ru: Резервная копия отменена
th: ยกเลิกการ Backup

# BackupTitle
source: Backup DataBase
ar: قاعدة بيانات النسخ الإحتياطي
es_es: Backup de la base de datos
fr: Sauvegarder la base de données
my: Backup အျဖစ္ထားရွိသည့္ Database
ru: База данных резервной копии

# EditRegionShapeFileMissingFiles
source: Invalid shapefile. Shape files must have: a .shp file, a .shx file and a .dbf file.
ar: خطأ في ملفات تحميل الخرائط. ملفات التحميل يجب أن تحتوي على .shp. .shx .dbf
es_es: Archivo shape inválido. Los archivos shapes deben tener: archivo .shp, archivo .shx y archivo .dbf.
fr: Shapefile non valide. Les Shapefiles doivent contenir: un fichier .shp, un fichier .shx et un fichier .dbf.
my: Shapefile ခုိင္လုံမႈမရွိပါ။ Shapefile မ်ားသည္ .shp file အမ်ိဳးအစား၊ .shx file အမ်ိဳးအစားႏွင့္ .dbf file အမ်ိဳးအစားတို႔ျဖစ္ရမည္။
ru: Недействительный шейп-файл. Шейп-файлы должны иметь: a .shp file, a .shx file and a .dbf file.
th: Shapefile ไม่ถูกต้อง Shapefile ต้องมีไฟล์ที่ประกอบด้วย .shp file, .shx file และ .dbf file

source: Import
ar: استيراد
es_es: Importar
fr: Importater
my: သြင္းသည္။ (Import)
ru: Импортировать
th: นำเข้าข้อมูล (Import)

# RegionsMustBeLoadedBeforeImport
source: Seems the selected model was created using an older version of ERMT. Before importing the model, you need to have the regions included added to your maps. Do you want to continue?
ar: يبدو أن النموذج تم وضعه باستخدام نسخة قديمة من الأداة. قبل استيراد النموذج، يجب اضافة المناطق على الخارطة. هل تريد الاستمرار؟
es_es: Parece que el modelo seleccionado fue creado con una versión antigua de ERMT. Antes de importar el modelo, necesita tener todas las regiones incluidas en el modelo cargadas. ¿Desea continuar?
fr: Le modèle choisi a été créé en utilisant une version antérieure de l'outil GRE. Avant d'importer le modèle, vous devez ajouter les régions comprises à vos cartes. Voulez-vous continuer?
my: Select ျပဳလုပ္ထားသည့္ Model အား ERMT ၏ Version အေဟာင္းျဖင့္ ဖန္တီးထားပုံရသည္။ ယခု Model အား Import မျပဳလုပ္မီတြင္ ပါ၀င္သည့္ေဒသမ်ားအား သင္၏ေျမပုံမ်ားအတြင္း ထည့္သြင္းရန္လိုအပ္သည္။ ဆက္လက္ေဆာင္ရြက္လုိပါသလား။
ru: Кажется, что выбранная модель была создана в старой версии ERMT. Прежде чем импортировать модель, вам необходимо добавить в карты включенные регионы. Хотите продолжить?
th: Model ที่เลือกมาจาก ERMT เวอร์ชั่นเก่า ก่อนการนำเข้า Model ใดๆ จะต้องมีแผนที่สำหรับ Model นั้นอยู่แล้ว

# ModelImportNotOk
source: Model was not imported.
ar: لم يتم استيراد النموذج
es_es: El modelo no pudo ser importado.
fr: Le modèle n'a pas été importé
my: Model အား Import မျပဳလုပ္ထားပါ။
ru: Модель не была импортирована
th: นำเข้า Model ไม่สำเร็จ

source: User
ar: مستخدم
es_es: Usuario
fr: Utilisateur
my: အသုံးျပဳသူ (User)
ru: Пользователь

source: Must select at least one option
ar: يجب تحديد خيار واحد على الأقل
es_es: Debe seleccionar al menos una opción
fr: Sélectionner au moins une option
my: အနည္းဆုံး တစ္ခုေတာ့ ေရြးရမည္။
ru: Необходимо выбрать хотя бы вариант
th: ต้องเลือกอย่างน้อย 1 Option

source: Restore loaded.
ar: تم تحميل ملفات الاستعادة
es_es: Restauración cargada.
fr: Restauré
my: Restore အား Load ျပဳလုပ္ျပီးျပီ။
ru: Восстановление завершено.
th: โหลดการกู้คืน (Restore Load)

# DataRestored
source: Data restored. Application will be closed for changes to take effect.
ar: تم استعادة البيانات. سيتم غلق التطبيق لتحيين الإعدادات
es_es: Datos restaurados. La aplicación debe ser cerrada para que los cambios tengan efecto.
fr: Données restaurées. Le logiciel sera fermé pour permettre aux modifications de prendre effet
my: Data အား Restore ျပဳလုပ္ျပီးပါျပီ။ ေျပာင္းလဲမႈမ်ား အသက္၀င္ေစရန္အတြက္ Application အား ပိတ္လုိက္ပါမည္။
ru: Данные восстановлены. Приложение будет закрыто для активации изменений.
th: การกู้คืน Data โปรแกรมจะปิดตัวเองเพื่อเริ่มต้นใหม่

# SelectedRestoreOptionsWereNotBackupFile
source: Some of the options selected for restoration were not on backup file
ar: بعض الخيارات المراد استعادتها لم تكن محفوظة
es_es: Algunas de las opciones seleccionadas para la restauración no están en el archivo backup.
fr: Certaines options sélectionnées pour être restaurer n'étaient pas compris dans la sauvegarde
my: Restore ျပဳလုပ္ရန္ ေရြးခ်ယ္ထားေသာ အခ်ိဳ႕ဖုိင္မ်ားသည္ Backup file မ်ားထဲတြင္ မရွိပါ။
ru: Некоторые варианты, выбранные для восстановления, не найдены в резервной копии
th: สิ่งที่เลือกบางรายการเพื่อ Restore ไม่อยู่ใน Backup file

# ModelImportNoExistsParentRegionInLocalDB
source: The parent region for the model you're trying to import couldn't be found.
ar: المنطقة المستخدمة في النموذج المراد استيراده ليست موجودة
es_es: No existe padre para una o más regiones a importar loclamente.
fr: La région parente pour le modèle que vous importez ne peut être trouvée.
my: သင္ Import ျပဳလုပ္ရန္ ၾကိဳးပမ္းေနေသာ Model အတြက္ Parent Region အား ရွာေဖြ၍မရပါ။
ru: Родительский регион для модели, которую вы пытаетесь импортировать, не найден
th: หาแผนที่ Parent Region สำหรับ Model ที่จะนำเข้าไม่พบ

# ModelImportNoExistsRegionsInLocalDB
source: There is no region for the model imported charged locally.
ar: لا يوجد منطقة في النموذج الذي تم استيراده
es_es: No existe región para el modelo importado cargada localmente.
fr: Pas de régions pour le modèle importé sur l'ordinateur.
my: Import ျပဳလုပ္ထားေသာ Model အတြက္ ေဒသမရွိပါ။
ru: Не существует региона для импортированной модели.
th: ไม่มีแผนที่ สำหรับ Model ที่นำเข้า

# SomeRegionsWereNotImported
source: Some regions were not imported correctly. Not matching with local regions
ar: بعض المناطق لم يتم استيرادها بنجاح. لا يوجد تطابق مع المناطق المحلية.
es_es: Algunas regiones no fueron cargadas correctamente. No coinciden con las regiones locales.
fr: Certaines régions n'ont pas été importées. Ne correspondent pas aux régions sur l'ordinateur
my: အခ်ိဳ႕ေဒသမ်ားအား မွန္ကန္စြာ Import မျပဳလုပ္ထားပါ။ Local Region မ်ားႏွင့္ ကုိက္ညီမႈမရွိပါ။
ru: Некоторые регионы были неправильно импортированы. Не соответствуют местным регионам.
th: แผนที่ที่นำเข้าบางรายการไม่ถูกต้อง

# ViewText
source: View
ar: عرض
es_es: Vista
fr: Afficher
my: ၾကည့္ရႈသည္။ (View)
ru: Просмотреть
th: ดู (View)

source: Table must have data.
ar: يجب ان يحتوي الجدول على بيانات
es_es: La tabla debe tener datos.
fr: Tableau doit contenir des données
my: ဇယားတြင္ Data ပါရွိရမည္။
ru: Таблица должна иметь данные
th: ตารางข้อมูล (Table) ต้องมีข้อมูล (Data)

# FileOverwriteConfirmation
source: The selected file exists already. Do you want to overwrite it?
ar: المستند المختار موجود. هل تريد استبداله.
es_es: El archivo seleccionado ya existe. Desea sobreescribirlo?
fr: Le fichier sélectionné existe déjà. Voulez-vous le remplacer?
my: ေရြးခ်ယ္ထားသည့္ File သည္ နဂုိကတည္းက ရွိျပီးသားျဖစ္သည္။ ၎အား Overwrite ျပဳလုပ္လိုပါသလား။
ru: Выбранный файл уже существует. Хотите перезаписать его?
th: File ข้อมูลที่ท่านเลือกมีอยู่แล้ว ต้องการที่จะเขียนทับหรือไม่

# PathSuccessfullySaved
source: The road was successfully saved.
ar: تم حفظ الطريق
es_es: El camino fue satisfactoriamente guardado.
fr: Chemin enregistré
my: လမ္းမ်ားအား ေအာင္ျမင္စြာ Save ျပဳလုပ္လုိက္ပါျပီ။
ru: Дорога была успешно сохранена.
th: บันทึกข้อมูลถนนสำเสร็จ

# POISuccessfullySaved
source: The POI was successfully saved.
ar: تم حفظ POI
es_es: El POI fue guardado satisfactoriamente.
fr: POI enregistré
my: POI အား ေအာင္ျမင္စြာ Save ျပဳလုပ္လုိက္ပါျပီ။
ru: POI был успешно сохранен
th: บันทึก POI สำเร็จ

# RegionChildsDeleteConfirm
source: Are you sure you want to delete {0}'s childs?
ar: هل أنت متأكد من حذف {0} منطقة فرعية
es_es: Está seguro que desea eliminar {0} región?
fr: Supprimer les régions dépendantes de {0} ?
my: {0} ၏ Child မ်ားကုိ Delete လုပ္လုိသည္မွာ ေသခ်ာပါသလား။
ru: Вы действительно хотите удалить дочерние регионы {0}?
th: คุณแน่ใจว่าจะลบ {0} Child หรือไม่ ?

# RegionChildsDeleted
source: All childs deleted.
ar: تم حذف كل المناطق الفرعية
es_es: Todos los hijos fueron eliminados.
fr: Toutes régions dépendantes supprimées.
my: Child မ်ားအားလုံးကုိ Delete လုပ္လုိက္ပါျပီ။
ru: Все дочерние регионы были удалены.
th: ลบ แผนที่ระดับ Child ทั้งหมด

# RegionHasNoChilds
source: This region has no childs.
ar: المنطقة لا تحتوي على مناطق فرعية
es_es: Esta región no tiene hijos.
fr: Cette région n'a pas de région dépendante.
my: ယခုေဒသတြင္ Child မရွိပါ။
ru: Этот регион не имеет дочерних регионов
th: แผนที่นี้ไม่มีแผนที่ระดับ Child

# RegionWithModels
source: There are models using this region, one of it's child regions or it's parent. Please delete the related models before deleting this region.
ar: يتم استخدام المنطقة أو احد فروعها من قبل نماذج أخرى. يرجى حذف هذه النماذج قبل حذف المنطقة.
es_es: Hay modelos que están utilizando esta región, uno de sus hijos o su padre. Por favor borre los modelos relacionados antes de borrar la región.
fr: Des modèles utilisent cette région ou une de ses régions parentes/dépendantes. Supprimer les modèles liés pour continuer.
my: ယခုေဒသ၊ ၎၏ Child Region သုိ႔မဟုတ္ Parent Region အား အသုံးျပဳထားသည့္ Model မ်ားရွိပါသည္။ ယခုေဒသအား Delete မလုပ္မီတြင္ ဆက္စပ္ေနသည့္ Model မ်ားအား ဦးစြာ Delete လုပ္ပါ။
ru: Существуют модели, которые используют этот регион, один из его дочерних регионов или родительских регионов. Пожалуйста, удалите эти модели прежде чем удалять этот регион.
th: มี Model บางอันใช้แผนที่นี้อยู่ ต้องลบ Model ที่ใช้แผนที่นี้ก่อน จึงจะสามารถลบแผนที่นี้ได้

# SaveAsKMLOK
source: KML file was successfully created.
ar: تم احداث ملفات KML
es_es: El archivo KML fue creado satisfactoriamente.
fr: Fichier KML crée
my: KML File အား ေအာင္ျမင္စြာ ဖန္တီးျပီးပါျပီ။
ru: KML был успешно создан.
th: บันทึกเป็น KML File สำหรับใช้กับ Google Earth

source: Cumulative factors
ar: عوامل تراكمية
es_es: Factores acumulativos.
fr: Facteurs cumulatifs
my: စုပုံေနေသာ Factor မ်ား
ru: Кумулятивные факторы
th: Factor แบบจำนวนนับ

source: Add Factor
ar: اضافة عامل
es_es: Agregar Factor
fr: Ajouter un facteur
my: Factor အား Add လုပ္မည္။
ru: Добавить Фактор
th: เพิ่ม Factor

source: Admin
ar: المسؤول
es_es: Adminitrador
my: စီမံခန္႔ခဲြသူ (Admin)
ru: Администратор

source: Backup
ar: نسخ احتياطي
fr: Sauvegarde
my: အရံ (Backup)
ru: Резервная копия
th: การสำรองข้อมูล (Backup)

source: Change Password
ar: تغيير كلمة السر
es_es: Modificar Contraseña
fr: Changer MdP
my: Password ေျပာင္းသည္။
ru: Изменить пароль
th: เปลี่ยน Password

source: Copy
ar: نسخ
es_es: Copiar
fr: Copier
ru: Копировать
th: คัดลอก (Copy)

source: Create new model
ar: انشاء نموذج جديد
es_es: Crear nuevo modelo
fr: Créer un nouveau modèle
my: Model အသစ္ဖန္တီးသည္။
ru: Создать новую модель
th: สร้าง Model ใหม่

source: Current model
ar: النموذج الحالي
es_es: Modelo actual
fr: Modèle actuel
my: လက္ရွိ Model
ru: Текущая модель
th: Model ที่กำลังใช้งานอยู่ในขณะนี้

source: Cut
ar: قص
es_es: Cortar
fr: Couper
ru: Вырезать
th: ตัด (Cut)

source: Data
ar: بيانات
es_es: Datos
fr: Données
my: အခ်က္အလက္ (Data)
ru: Данные
th: ข้อมูล (Data)

source: Delete
ar: حذف
es_es: Eliminar
fr: Supprimer
ru: Удалить
th: ลบ (Delete)

source: Edit
ar: تعديل
es_es: Editar
fr: Modifier
my: ျပင္ဆင္သည္။ (Edit)
ru: Редактировать
th: แก้ไข (Edit)

source: English
ar: الإنجليزية
es_es: Inglés
fr: Anglais
my: အဂၤလိပ္ဘာသာ
ru: Английский
th: ภาษาอังกฤษ

source: Exit
ar: خروج
es_es: Salir
fr: Sortie
my: ထြက္သည္။ (Exit)
ru: Выход
th: ออกจากโปรแกรม (Exit)

source: Export
ar: تصدير
es_es: Exportar
fr: Exporter
my: Export ထုတ္သည္။
ru: Экспортировать
th: นำข้อมูลออก (Export)

source: Feedback
ar: تعليقات
fr: Commentaires
my: မွတ္ခ်က္ (Feedback)
ru: Обратная связь от пользователя

source: File
ar: ملف
es_es: Archivo
fr: Fichier
ru: Файл
th: ไฟล์ (File)

source: Help
ar: مساعدة
es_es: Ayuda
fr: Aide
my: ကူညီသည္။ (Help)
ru: Помощь
th: การช่วยเหลือ (Help)

source: Import model
ar: استيراد ملف
es_es: Importar modelo
fr: Importer un modèle
my: Model အား Import ျပဳလုပ္သည္။
ru: Импортировать модель
th: นำเข้า Model (Import model)

source: Index
ar: فهرس
es_es: Índice
my: ညႊန္းကိန္း (Index)
ru: Индекс
th: ดัชนี (Index)

source: Language
ar: اللغة
es_es: Idioma
fr: Langue
my: ဘာသာစကား
ru: Язык
th: ภาษา

source: Manage Regions
ar: إدارة المناطق
es_es: Administrar Regiones
fr: Gérer les régions
my: ေဒသမ်ားအား စီမံခန္႔ခဲြသည္။
ru: Управление регионами
th: การแก้ไขเพิ่มเติมแผนที่

source: Mapping
ar: رسم الخرائط
es_es: Mapa
fr: Cartographie
my: ေျမပုံေရးဆဲြျခင္း။
ru: Картирование
th: การทำแผนที่

source: Marker Types
ar: أنماط المؤشر
es_es: Tipo de Marcadores
fr: Types de marqueur
my: Marker အမ်ိဳးအစားမ်ား
ru: Типы Маркеров
th: ประเภทของ Marker

source: Modify Electoral Cycle Phase
ar: تعديل الدورة الإنتخابية
es_es: Modificar Fase del Ciclo Electoral
fr: Modifier une phase du cycle électoral
my: ေရြးေကာက္ပြဲစက္၀န္းရွိ အဆင့္မ်ားအား Modify ျပဳလုပ္သည္။
ru: Изменить Фазу Электорального Цикла
th: แก้ไขวงจรการเลือกตั้ง

source: Modify Existing User
ar: تعديل مستخدم حالي
es_es: Modificar Usuario Existente
fr: Modifier utilisateur
my: လက္ရွိ User အား Modify ျပဳလုပ္သည္။
ru: Изменить Существующего Пользователя
th: แก้ไข User

source: Paste
ar: لصق
es_es: Pegar
fr: Coller
ru: Вставить
th: วาง (Paste)

source: Responses
ar: الإجراءات المتخذة
es_es: Respuestas
fr: Mesures
my: တုံ႔ျပန္မႈမ်ား (Response)
ru: Ответы
th: การแก้ไขปัญหา(Response)

source: Restore
ar: استعادة
es_es: Restauración
fr: Restaurer
my: ျပန္လည္ထိန္းသိမ္းသည္။ (Restore)
ru: Восстановить
th: การกู้คืน (Restore)

source: Server Address
ar: عنوان السورفر
es_es: Dirección del Servidor
fr: Adresse du serveur
my: ဆာဗာလိပ္စာ (Server Address)
ru: Адрес Сервера
th: ที่อยู่ Server (Server Address)

source: Show text control
ar: عرض اختبار التحكم
es_es: Mostrar control de texto
fr: Afficher control test
my: စာသားမ်ားအား စီမံခန္႔ခဲြသည့္ေနရာ ျပသသည္။
ru: Показать текстовый элемент управления
th: แสดงข้อมูลการควบคุม

source: Spanish
ar: الإسبانية
es_es: Español
fr: Espagnol
my: စပိန္ဘာသာ
ru: Испанский
th: ภาษาสเปน

source: User Admin
ar: مسؤول المستخدمين
es_es: Administración de Usuarios
fr: Administration des utilisateurs
my: အသုံးျပဳသူ၏ စီမံခန္႔ခဲြမႈ (User Admin)
ru: Пользователь Администратор

source: View Factors
ar: قائمة العوامل
es_es: Ver Factores
fr: Afficher les facteurs
my: Factor မ်ားအား ၾကည့္ရႈသည္။
ru: Просмотреть Факторы
th: ดู Factor

# ExitToChangeLanguage
source: To change language, you must restart the application. Are you sure?
ar: لتغيير اللغة يجب اعادة فتح التطبيق. هل أنت متأكد؟
es_es: Para modificar el lenguaje, usted debe reiniciar la aplicación. Está seguro?
fr: Pour changer de langue, redémarrer le logiciel. Etes-vous sûr ?
my: ဘာသာစကားအား ေျပာင္းလဲရန္အတြက္ Application ကုိ Restart လုပ္ရမည္။ လုပ္လုိပါသလား။
ru: Чтобы изменить язык необходимо перезагрузить приложение. Вы уверены?
th: การเปลี่ยนภาษาต้อง Restart โปรแกรมใหม่อีกครั้ง ท่านต้องการจะเปลี่ยนภาษาหรือไม่

# EditRegionTitle
source: Edit Region
ar: تعديل منطقة
es_es: Editar Región
fr: Modifier région
my: ေဒသအားျပင္ဆင္သည္။
ru: Редактировать Регион
th: แก้ไขแผนที่

# ServerConnectionError
source: There was an error trying to connect to the server. Please enter the server hostname or IP address.
ar: هناك خطا في في الاتصال بالسورفر. يرجى إدخال اسم السورفر أو IP
es_es: Hubo un error al conectarse al servidor. Por favor ingrese el hostname o direccion de IPdel servidor
fr: Erreur en essayant de se connecter au serveur. Saisir le nom de l'hôte du serveur ou l'adresse IP.
my: Server အား ခ်ိတ္ဆက္ရာတြင္ Error တစ္ခုေပၚေပါက္လာပါသည္။ Server Hostname သုိ႔မဟုတ္ IP Address အား ျဖည့္သြင္းေပးပါ။
ru: Произошла ошибка при попытке соединения с сервером. Пожалуйста, введите хост имя сервера или его IP адрес
th: การเชื่อต่อ Server ผิดพลาด (Error) โปรดระบุ Server Hostname หรือ IP Address

# ModelImportMainRegionDoesNotExits
source: The main region of the model you are trying to import doesn't exists in your local database.
ar: المنطقة المراد استيرادها لا توجد في قاعدة البيانات
es_es: La región principal del modelo que se está tratando de importar no existe en la base de datos local.
fr: La région principale du modèle que vous essayez d'importer n'existe pas dans votre base de données locale.
my: သင္ Import ျပဳလုပ္ရန္ ၾကိဳးပမ္းေနေသာ Model ၏ အဓိကေဒသသည္ သင္၏ Database ထဲတြင္ မရွိပါ။
ru: Главный регион модели, который вы пытаетесь импортировать, не существует в вашей текущей базе данных
th: Model ที่จะนำเข้าไม่มีแผนที่รองรับ

# FactorCRUDDescriptionField1
source: Introduction
ar: المقدمة
es_es: Introducción
my: မိတ္ဆက္
ru: Введение
th: คำนำ

# FactorCRUDDescriptionField2
source: Empirical Cases
ar: التجارب
es_es: Casos Empíricos
fr: Cas empiriques
ru: Практические кейсы
th: กรณีตัวอย่าง

# FactorCRUDDescriptionField3
source: Observable Indicators
ar: المؤشرات الملحوظة
es_es: Indicadores observables
fr: Indicateurs observables
my: ျမင္ေတြ႕ႏုိင္ေသာ Indicator မ်ား။
ru: Индикаторы наблюдения
th: ตัวชี้วัด

# FactorCRUDDescriptionField4
source: Data Collection
ar: تجميع البيانات
es_es: Colección de datos
fr: Collecte de données
my: Data ေကာက္ယူျခင္း။
ru: Сбор данных
th: การรวบรวมข้อมูล

# FactorCRUDDescriptionField5
source: Questionnaire
ar: الإستبيان
es_es: Cuestionario
my: ေမးခြန္းမ်ား
ru: Вопросник
th: แบบสอบถาม

# DataRestoreError
source: An error ocurred trying to restore the database.
ar: خطأ في محاولة استرجاع قاعدة البيانات
es_es: Ha ocurrido un error al intentar restaurar la base de datos.
fr: Erreur en essayant de restaurer la base de données
my: Database အား Restore ျပဳလုပ္ရန္ၾကိဳးပမ္းရာတြင္ Error ေပၚေပါက္လာပါသည္။
ru: Произошла ошибка при попытке восстановления базы данных
th: ความผิดพลาดเนื่องจากการกู้คืน Database

# DataRestoreInvalidDBVersion
source: The database's version included in the backup is invalid.
ar: خطأ في قاعدة البيانات ضمن النسخة الإختياطية
es_es: La versión de la base de datos incluida en el backup es inválida.
fr: La version de la base de données comprise dans la sauvegarde est invalide.
my: Backup ထဲတြင္ ပါ၀င္ေသာ Database ၏ Version သည္ ခုိင္မာမႈမရွိပါ။
ru: Версия базы данных в резервной копии недействительна
th: Database Version ไม่ถูกต้อง

# ModelExportOk
source: Model was successfully exported. A folder named MODELSHAPEFILES has been created, containing the model's related shapefiles, in case you need to create the regions in the destination computer.
ar: تم تصدير النموذج. تم إنشاء ملف MODELSHAPEFILES يتضمن خرائط النموذج في حال أردت أنشاء مناطق في الكومبيوتر الوجهة.
es_es: El modelo fue satisfactoriamente exportado. Se creó una carpeta llamada MODELSHAPEFILES, y contiene los shapefiles del modelo, en caso de que sea necesario crear las regiones en la computadora de destino.
fr: Modèle exporté. Un dossier MODELSHAPEFILES a été créé contenant les Shapefiles du modèle au cas où vous avez besoin de créer des régions dans l'ordinateur de destination.
my: Model အား ေအာင္ျမင္စြာ Export ျပဳလုပ္ျပီးပါျပီ။ MODELSHAPEFILES ဟုအမည္ေပးထားေသာ Folder အားလည္း ဖန္တီးေပးထားပါသည္။ သင့္အေနျဖင့္ ကြန္ျပဴတာထဲတြင္ ေဒသမ်ား ဖန္တီးလုိလွ်င္ အသုံးျပဳႏုိင္ရန္အတြက္ ၎ Folder ထဲတြင္ Model ႏွင့္သက္ဆုိင္သည့္ Shapefile မ်ားအား ထည့္သြင္းထားေပးပါသည္။
ru: Модель была успешно экспортирована. Было создано имя папки MODELSHAPEFILES, состоящей из соответствующих модели шейп-файлов, необходимых для создания регионов в конечном компьютере.
th: การส่งออกModelสำเร็จ โฟเดอร์ของ Model ถูกสร้างอยู่ที่MODELSHAPEFILES
