Repository: InternationalIDEA/ERMT
Catalog: Idea.ERMT/Idea.Facade/General.*.resx
Languages: ar, es_es, fr, my, ru, th

source: About
ar: عن الأداة
es_es: Acerca de
fr: A propos de
my: အေၾကာင္းအရာ
ru: О программе
th: เกี่ยวกับ

# AddShapeBeforeSave
source: Either add a .shp file or draw a region before saving.
ar: يرجى اضافة ملف تحميل خرائط .shp أو رسم المنطقة قبل الحفظ
es_es: Agregar un archivo .shp o dibujar una región antes de guardar.
fr: Ajouter un fichier .shp ou dessiner une région
my: Save မလုပ္မီတြင္ .shp file တစ္ခု add လုပ္ျခင္း သုိ႔မဟုတ္ နယ္နိမိတ္အား မိမိကုိယ္တုိင္ေရးဆြဲျခင္း ျပဳလုပ္ပါ။
ru: Вставьте .shp файл либо нарисуйте регион перед сохранением
th: เพิ่ม.shp file หรือ วาดแผนที่ ก่อนSave

# AllOcurrencesReplaced
source: All occurrences have been replaced!
ar: تم استبدال كل الحوادث !
es_es: Todos los casos han sido reemplazados!
fr: Toutes les occurrences ont été remplacées!
my: ျဖစ္ရပ္မ်ားအားလုံးကုိ အစားထုိးလုိက္ပါျပီ။
ru: Все события были удалены
th: แทนที่ทุกการประมวลผล

# AtLeastOneFactor
source: At least one factor must be selected.
ar: يرجى تحديد عامل واحد على الأقل
es_es: Al menos un factor debe ser seleccionado.
fr: Au moins un facteur doit être sélectionné
my: အနည္းဆုံး Factor တစ္ခုအား Select လုပ္ရပါမည္။
ru: Как минимум один фактор должен быть выбран
th: เลือกอย่างน้อยหนึ่ง Factor

source: Backup Saved.
ar: نسخ احتياطي محفوظ
es_es: Backup guardado.
fr: Sauvegardé
my: Backup အား Save လုပ္ျပီးပါျပီ။
ru: Резервная копия сохранена
th: สำรองข้อมูลเสร็จแล้ว

# ConfirmDeleteUser
source: Are you sure you want to delete the selected user?
ar: هل أنت متأكد من حذف المستخدم
es_es: Está seguro de querer borrar el usuario seleccionado?
fr: Supprimer utilisateur ?
my: Select လုပ္ထားေသာ User အား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить выбранного пользователя?
th: คุณแน่ใจว่าจะลบ User รายนี้ใช่หรือไม่

# ConfirmDeleteUserTitle
source: Confirmation
ar: تأكيد
es_es: Confirmación
my: အတည္ျပဳခ်က္
ru: Подтверждение
th: ยืนยัน

# DatabaseRestored
source: Database restored. Application will be closed for changes to take effect.
ar: تم استرجاع قاعدة البيانات. سيتم غلق التطبيق حتى تصبح التعديلات نافذة المفعول.
es_es: Base de datos restaurada. La aplicación deberá ser cerrada para que los cambios tengan efecto.
fr: Base de données restauré. L'application va fermer pour effectuer les changements
my: Database အား Restore ျပဳလုပ္လုိက္ပါျပီ။ ေျပာင္းလဲမႈမ်ား အသက္၀င္ေစရန္အတြက္ Application အား ပိတ္လိုက္ပါမည္။
ru: База данных восстановлена. Приложение будет закрыто для сохранения изменений.
th: การกู้คืน Database โปรแกรมจะหยุดการทำงาน ก่อนเริ่มต้นโปรแกรมใหม่อีกครั้ง

# DataChangedSaveMessage
source: Data has been changed. Do you want to save it?
ar: تم تعديل البيانات، هل تريد حفظها
es_es: Los datos han sido modificados. Está seguro de guardarlos?
fr: Données modifiées. Enregistrer ?
my: Data အား ေျပာင္းလဲလုိက္ပါျပီ။ ၎ကုိ Save လုပ္ခ်င္ပါသလား။
ru: Данные были изменены. Сохранить их?
th: ข้อมูลเปลี่ยนแปลงแล้ว ท่านต้องการจะบันทึก หรือไม่

# DataChangedTitle
source: Warning
ar: تحذير
es_es: Cuidado
fr: Alerte
my: သတိေပးခ်က္
ru: Предупреждение
th: คำเตือน โปรดระมัดระวัง

# DataSavedOK
source: Data was successfully saved
ar: تم حفظ البيانات
es_es: Los datos han sido satisfactoriamente guardados
fr: Données enregistrées
my: Data အား ေအာင္ျမင္စြာ Save လုပ္လိုက္ပါျပီ။
ru: Данные были успешно сохранены
th: บันทึกข้อมูลสำเร็จแล้ว

# DeleteQuestion
source: Are you sure you want to delete this model?
ar: هل أنت متأكد من حذف النموذج؟
es_es: Está seguro que desea borrar este modelo?
fr: Voulez-vous supprimer ce modèle ?
my: လက္ရွိ Model အား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить эту модель?
th: ท่านต้องการลบ Model นี้ หรือไม่

# DeleteModel
source: Are you sure that you want delete this model?
ar: هل أنت متأكد من حذف النموذج؟
es_es: Está seguro que desea borrar este modelo?
fr: Voulez-vous supprimer ce modèle ?
my: လက္ရွိ Model အား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить эту модель?
th: ท่านต้องการลบ Model นี้หรือไม่

# DocumentAddedOk
source: Document added
ar: تم اظافة المستند
es_es: Documento agregado
fr: Document ajouté
my: Document ထည့္သြင္းလုိက္ပါျပီ။
ru: Документ добавлен
th: เพิ่มเอกสาร

# DocumentSavedText
source: The document was successfully saved.
ar: تم حفظ المستند
es_es: El documento ha sido guardado satisfactoriamente.
fr: Document enregistré
my: Document အား ေအာင္ျမင္စြာ Save လုပ္လုိက္ပါျပီ။
ru: Документ был успешно сохранен
th: บันทึกเอกสารสำเร็จแล้ว

source: Error
ar: خطأ
fr: Erreur
my: မွားေနသည္။ (Error)
ru: Ошибка
th: ผิดพลาด (Error)

source: Error deleting user
ar: خطأ في حذف المستخدم
es_es: Error borrando usuario
fr: Erreur : utilisateur pas supprimé
my: User အား Delete လုပ္ရာတြင္ Error တက္ေနသည္။
ru: Ошибка при удалении пользователя
th: การลบ User ผิดพลาด (Error)

source: Error saving data
ar: خطأ في حفظ البيانات
es_es: Error borrando datos
fr: Erreur : données pas enregistré
my: Data အား Save လုပ္ရာတြင္ Error တက္ေနသည္။
ru: Ошибка при удалении данных
th: บันทึกข้อมูลผิดพลาด (Error)

source: Error saving user
ar: خطأ في حفظ المستخدم
es_es: Error guardando usuario
fr: Erreur : utilisateur pas enregistré
my: User အား Save လုပ္ရာတြင္ Error တက္ေနသည္။
ru: Ошибка при сохранении пользователя
th: บันทึก User ผิดพลาด (Error)

# FactorSavedOk
source: Factor saved
ar: تم حفظ العامل
es_es: Factor guardado
fr: Facteur enregistré
my: Factor အား Save လုပ္လုိက္ပါျပီ။
ru: Фактор сохранен
th: บันทึก Factor แล้ว

# FactorSavedOkTitle
source: Confirmation
ar: تأكيد
es_es: Confirmación
my: အတည္ျပဳခ်က္
ru: Подтверждение
th: ยืนยัน

# FactorsChangedMessage
source: Some factors have been changed, do you really want to save? (Data for removed factors will be lost)
ar: تم تعديل بعض العوامل، هل تريد الحفظ؟ (سيتم الغاء بيانات العوامل المحذوفة)
es_es: Algunos factores han sido modificados. Está seguro que desea guardar los cambios? (Los datos para factores eliminados se perderán)
fr: Certains facteurs ont été modifiés, voulez-vous enregistrer? (Les données pour les facteurs supprimés seront perdues)
my: အခ်ိဳ႕ Factor မ်ားအား ေျပာင္းလဲထားပါသည္။ Save လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။ (ဖယ္ရွားလုိက္သည့္ Factor မ်ား၏ Data မ်ားအား ဆုံးရႈံးမည္ျဖစ္သည္။)
ru: Некоторые факторы были изменены, вы действительно хотите их сохранить? (Данные удаленных факторов будут утеряны)
th: มีการแก้ไขเปลี่ยนแปลง Factor บางตัว , ท่านต้องการที่จะบันทึก Factor ที่แก้ไขหรือไม่ (ระวัง การเปลี่ยนแปลง Factor อาจทำให้ข้อมูลสูญหายได้)

# FactorsChangedMessageTitle
source: Changed Factors
ar: تعديل عامل
es_es: Factores modificados
fr: Facteurs modifiés
my: ေျပာင္းလဲထားသည့္ Factor မ်ား
ru: Измененные факторы
th: การเปลี่ยนแปลง Factor

source: Find and Replace
ar: بحث و استبدال
es_es: Encuentra y reemplaza
fr: Rechercher et remplacer
my: ရွာေဖြျပီး အစားထုိးသည္။
ru: Найти и заменить
th: ค้นหา และแทนที่

# ModelImportError
source: There was an error trying to import the model, check the file is correct.
ar: خطأ في استيراد النموذج، تأكد من الملف
es_es: Hubo un error intentando importar el modelo. Verifique que el archivo es correcto.
fr: Erreur : le modèle n'a pas été importé. Veuillez vérifier le fichier
my: Model အား Import ျပဳလုပ္ရာတြင္ Error တက္ေနသည္။ မွန္ကန္ေသာ File အား ေရြးခ်ယ္ထားျခင္းရွိ/မရွိ ျပန္လည္စစ္ေဆးပါ။
ru: Произошла ошибка при попытке импортировать модель, проверьте файл
th: มีความผิดพลาด ในการนำเข้า Model โปรดตรวจสอบ ไฟล์ ที่นำเข้าว่าถูกต้องหรือไม่

# ModelImportErrorCaption
source: Error
ar: خطأ
fr: Erreur
my: မွားေနသည္။ (Error)
ru: Ошибка
th: ผิดพลาด (Error)

# ModelImportOk
source: Model successfully imported.
ar: تم استيراد النموذج
es_es: Modelo importado exitosamente.
fr: Modèle importé
my: Model အား ေအာင္ျမင္စြာ Import ျပဳလုပ္လိုက္ပါျပီ။
ru: Модель успешно импортирована
th: การนำเข้า Model สำเร็จ

# ModelSavedOk
source: Model was successfully saved.
ar: تم حفظ النموذج
es_es: El modelo fue satisfactoriamente guardado.
fr: Modèle enregistré
my: Model အား ေအာင္ျမင္စြာ Save ျပဳလုပ္လိုက္ပါျပီ။
ru: Модель успешно сохранена
th: บันทึก Model สำเร็จ

# ModelSavingError
source: Error saving model
ar: خطأ في حفظ النموذج
es_es: Error guardando el modelo
fr: Erreur : modèle pas enregistré
my: Model အား Save လုပ္ရာတြင္ Error တက္ေနသည္။
ru: Ошибка при сохранении модели
th: การบันทึก Model ผิดพลาด (Error)

# NoFactorsInModel
source: There are no factors in the selected model
ar: لا يوجد عوامل في النموذج المحدد
es_es: No existen factores en el modelo seleccionado
fr: Pas de facteurs dans le modèle sélectionné
my: Select လုပ္ထားသည့္ Model တြင္ Factor မရွိပါ။
ru: В выбранной модели нет факторов
th: ไม่ได้เลือก Factor สำหรับ Model นี้

# RegionDeleteConfirm
source: Are you sure you want to delete {0} region?
ar: هل انت متأكد من حذف (0) منطقة
es_es: Está seguro que desea eliminar {0} región?
fr: Supprimer région {0} ?
my: {0} ေဒသအား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить {0} регион?
th: ท่านต้องการลบ (Delete ) {0} แผนที่ระดับนี้ใช่หรือไม่

# RegionDeleteConfirmTitle
source: Confirm deletion
ar: تأكيد الحذف
es_es: Confirmar borrado.
fr: Confirmer
my: Delete လုပ္သည္ကုိ အတည္ျပဳပါ။
ru: Подтвердите удаление
th: ยืนยันการลบ (Delete)

source: Region deleted
ar: تم حذف المنطقة
es_es: Región eliminada
fr: Région supprimé
my: ေဒသအား Delete လုပ္လုိက္ပါျပီ။
ru: Регион удален
th: ลบ (Delete ) แผนที่

# RegionNotDelete
source: This region can't be deleted because it's being used in a model.
ar: لا يمكن حذف المنطقة لأنها مستعملة في نموذج
es_es: Esta región no puede ser eliminada porque está siendo utilizada por un modelo.
fr: Cette région ne peut pas être supprimée - utilisée pas un modèle
my: Model တစ္ခုတြင္ အသုံးျပဳ ထားသျဖင့္ ဤေဒသအား Delete လုပ္၍မရပါ။
ru: Этот регион не может быть удален, так как используется в модели
th: แผนที่นี้ไม่สามารลบ ได้ เนื่องจาก Model บางอันใช้งานอยู่

# ReportDelete
source: Are you sure you want to delete these saved settings?
ar: هل أنت متأكد من حذف الاعدادات
es_es: Está seguro de querer eliminar las configuraciones guardadas?
fr: Supprimer les paramètres enregistrés ?
my: Save လုပ္ထားေသာ Setting မ်ားအား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить эти сохраненные настройки?
th: ต้องการที่จะลบการตั้งค่าหรือไม่

# ReportWithTheSameName
source: Already exist a Report with the same name.
ar: يوجد تقرير بنفس الاسم
es_es: Ya existe un reporte con el mismo nombre.
fr: Rapport avec le même nom existe déjà
my: အမည္တူျဖင့္ Report တစ္ခု ရွိျပီးသားျဖစ္သည္။
ru: Отчет с таким именем уже существует
th: ตั้งชื่อ Report ซ้ำ

# RequiredName
source: Name is required
ar: مطلوب اسم
es_es: El nombre es requerido
fr: Un nom est obligatoire
my: အမည္တစ္ခုေပးရန္ လိုအပ္သည္။
ru: Необходимо название
th: ต้องตั้งชื่อด้วย

# SaveReportCaption
source: Save Settings
ar: حفظ الاعدادات
es_es: Guardar Configuración
fr: Enregistrer les paramètres
my: Setting မ်ားအား Save လုပ္ပါ။
ru: Сохранить настройки
th: บันทึกการตั้งค่า

# SaveReportError
source: There was an error saving the settings.
ar: خطأ في حفظ الاعدادات
es_es: Hubo un error guardando la configuración.
fr: Erreur : paramètres pas enregistrés
my: Setting မ်ားအား Save လုပ္ရာတြင္ Error တစ္ခု တက္ေနသည္။
ru: Ошибка при сохранении настроек
th: บันทึกการตั้งค่าผิดพลาด

# SaveReportOk
source: Settings were successfully saved.
ar: تم حفظ الاعدادات
es_es: La configuración fue guardada satisfactoriamente.
fr: Paramètres enregistrés
my: Setting မ်ားအား ေအာင္ျမင္စြာ Save လုပ္လုိက္ပါျပီ။
ru: Настройки были успешно сохранены
th: บันทึกการตั้งค่าสำเร็จ

# ShapeFileMultiple
source: The file has multiple shapes but there is no DBF file for naming them. The program will group all shapes in the file into one unique region. Click Yes if you want to continue or click No to abort.
ar: يحتوي الملف على العديد من الأشكال و لا يوجد ملف DBF لتسميتهم. سيجمع البرنامج كل الأشكال في منطقة واحدة. اضغط على نعم في حال رغبت بالمواصلة أو على لا في حال رغبت التوقف
es_es: El archivo tiene varios shapes, pero no hay ningún archivo DBF para nombrarlos . La aplicación agrupará todos los shapes en el archivo dentro de una única región. Clickee Sí si desea continuar o No para cancelar.
fr: Le fichier a de multiples formes, mais il n'y a pas de fichier DBF pour les nommer. Le logiciel regroupera toutes les formes dans le fichier dans une région unique. Cliquez sur Oui si vous voulez continuer ou cliquez sur Non pour annuler.
my: ယခု File တြင္ Shape မ်ားပါ၀င္ေနေသာ္လည္း ၎တုိ႔ကုိ အမည္ေပးရန္အတြက္ DBF File အမ်ိဳးအစား ပါ၀င္ျခင္းမရွိပါ။ ယခု File အတြင္းရွိ Shape မ်ားအားလုံးကုိ ေဒသတစ္ခုအျဖစ္ အုပ္စုဖဲြ႕ေပးမည္ျဖစ္ပါသည္။ အဆုိပါအတုိင္း ဆက္လက္ေဆာင္ရြက္လုိပါက Yes ခလုပ္အား ႏႈိပ္ပါ။ ဆက္လက္မေဆာင္ရြက္လုိပါက No ခလုပ္အားႏွိပ္ပါ။
ru: У файла несколько форм, но нет DBF файла для его названия. Программа сгруппирует все формы в файл одного уникального региона. Нажмите "Да", если хотите продолжить, "Нет", если хотите отменить.
th: มี Shape file หลายค่า แต่ไม่มี DBF file ที่ตรงกัน โปรแกรมจะทำการประมวลผล Shape File เป็นพื้นที่เดียวกัน กด Yesเพื่อยืนยันที่จะดำเนินการต่อไปกด NO เพื่อยกเลิก

# ShapeFileMultipleNoDBF
source: An associated dbf file is needed for importing multiple regions from the same shapefile.
ar: يلزم ملف DBF لاستيراد مناطق عديدة من نفس ملف الخرائط .shp
es_es: Es necesario asociar un archivo.dbf para importar múltiples regiones desde el mismo archivo shape.
fr: Un fichier DBF lié est nécessaire pour l'importer plusieurs régions du même shapefile.
my: Shapefile တစ္ခုတည္းမွ ေဒသမ်ားအား Import ျပဳလုပ္ရန္အတြက္ ပူးတြဲထားေသာ DBF File တစ္ခု လုိအပ္ပါသည္။
ru: Связующий dbf файл необходим для импортирования более, чем одного региона из того же самого шейп-файла
th: ต้องการ DBF File ที่สอดคล้องกับแผนที่ เพื่อนำเข้าข้อมูลที่มีแผนที่หลายระดับใน shapefile เดียวกัน

# ShapeFilePaths
source: Only polygon type shapefiles are allowed. The file you selected appears to have paths inside.
ar: يسمح فقط لملفات الخرائط shp. التي تحتوي على مناطق مغلقة. الملفات التي تم تحديدها تحتوي على طرق.
es_es: Solo los archivos shape del tipo polígono están permitidos. El archivo que seleccionó pareciera tener rutas adentro.
fr: Seuls les shapefiles de type polygone sont autorisés. Le fichier que vous avez sélectionné semble avoir des chemins à l'intérieur.
my: Polygon အမ်ိဳးအစား Shapefile မ်ားကုိသာလွ်င္ ခြင့္ျပဳထားပါသည္။ ယခုသင္ေရြးခ်ယ္ထားေသာ File ထဲတြင္ လမ္းေၾကာင္းမ်ား ပါေနပုံရသည္။
ru: Разрешены только шейп-файлы типа Полигон. Файл, который вы выбрали имеет пути внутри себя.
th: อนุญาตเฉพาะPolygon Shapefile เท่านั้น ไฟล์ที่เลือกมี Paths รวมอยู่ด้วย

# UserDeletedOk
source: User successfully deleted.
ar: تم حذف المستخدم
es_es: El usuario fue satisfactoriamente eliminado.
fr: Utilisateur supprimé
my: User အားေအာင္ျမင္စြာ Delete လုပ္လုိက္ပါျပီ။
ru: Пользователь успешно удален
th: ลบ User สำเร็จ

# UserSavedOk
source: User successfully saved.
ar: تم حفظ المستخدم
es_es: El usuario fue satisfactoriamente guardado.
fr: Utilisateur enregistré
my: User အားေအာင္ျမင္စြာ Save လုပ္လုိက္ပါျပီ။
ru: Пользователь успешно сохранен
th: บันทึก User สำเร็จ

# UserSavedOkCaption
source: Confirmation
ar: تأكيد
es_es: Confirmación
my: အတည္ျပဳခ်က္
ru: Подтверждение
th: ยืนยัน

# WorldContinentNotDelete
source: World and continents cannot be deleted.
ar: لا يمكن حذف خريطة العالم و القارات
es_es: El mundo y los continentes no pueden ser eliminados.
fr: Monde et continents ne peuvent pas être supprimés
my: ကမၻာႏွင့္ တုိက္ၾကီးမ်ားအား Delete လုပ္၍မရပါ။
ru: Мир и континенты не могут быть удалены
th: แผนที่โลกและทวีปไม่สามารถลบทิ้งได้

# FactorsChangedMessage2
source: If you change minimum, maximum or interval for a factor, all data for that factor will be lost when you save changes.
ar: في حال تعديل الحد الأقصى أو الأدنى أو مساحة عامل, ستحذف بيانات العامل عند حفظ التعديلات
es_es: Si usted modifica el valor mínimo, máximo o el intervalo para un factor, se perderán todos los datos cuando guarde los cambios.
fr: Si vous changez le minimum, le maximum ou l'intervalle pour un facteur, toutes les données pour ce facteur seront perdus lorsque vous enregistrez les modifications.
my: Factor တစ္ခုအတြက္ Minimum၊ Maximum သုိ႔မဟုတ္ Interval တုိ႔ကုိေျပာင္းလဲလုိက္ပါက ၎ Factor ႏွင့္စပ္လ်ဥ္းျပီး Save လုပ္ထားသည့္ Data မ်ားအားလုံးကုိ ဆုံးရႈံးမည္ျဖစ္သည္။
ru: Если вы измените минимальное, максимальное или промежуточное значение для фактора, все данные этого фактора будут утеряны во время сохранения
th: ถ้าเปลี่ยนแปลงค่าต่ำสุด (Min) และ ค่าสูงสุด (Max) หรือเปลี่ยนแปลงช่วงห่าง ( Interval) ข้อมูลของ Model ที่ใช้ Factor นี้อยู่จะหายทั้งหมด

# NoMarkerTypes
source: There are no marker types defined
ar: لا يوجد أنماط مؤشرات محددة
es_es: No hay tipos de marcadores definidos
fr: Types de marqueurs ne sont pas définis
my: Marker အမ်ိဳးအစားမ်ားအား Define ျပဳလုပ္ထားျခင္း မရွိပါ။
ru: Маркеры не определены
th: ไม่ได้กำหนด Marker Type ไว้

# MarkerValidation
source: Please make sure correct values were entered. Name, latitude and longitude are required fields.
ar: يرجى التأكد من صحة القيم. الإسم و خطوط الطول و العرض ضرورية
es_es: Por favor, verificar que los valores ingresados son correctos. Nombre, latitud y longitud son campos requeridos.
fr: Assurez-vous que les valeurs correctes ont été saisies. Le nom, la latitude et la longitude sont des champs obligatoires.
my: မွန္ကန္သည့္ Value မ်ားအား ျဖည့္စြက္ထားေၾကာင္း ေသခ်ာေအာင္လုပ္ပါ။ Name၊ Latitude ႏွင့္ Longitude တုိ႔ကို ျဖည့္သြင္းရန္လုိအပ္သည္။
ru: Пожалуйста, проверьте правильность вводимых значений. Имя, широта и долгота обязательные для заполнения поля.
th: การบันทึกค่า ชื่อพื้นที่ (Name) เส้นรุ้ง (Latitude) และเส้นแวง (Longitude) แต่ละค่าต้องถูกต้อง ให้ทำด้วยความระมัดระวัง

# Allfieldsrequired
source: All fields are required
ar: كل الحقول ضرورية
es_es: Todos los campos son requeridos.
fr: Tous les champs sont obligatoires
my: ကြက္လပ္အားလုံးကုိ ျဖည့္သြင္းရန္လိုအပ္သည္။
ru: Все поля обязательные для заполнения
th: ต้องการทุก Field

# Confirm
source: Confirmation
ar: تأكيد
es_es: Confirmación
my: အတည္ျပဳခ်က္
ru: Подтверждение
th: ยืนยัน

# ConfirmDeleteMarkerType
source: All markers of this type will be lost. Are you sure you want to delete this marker type?
ar: سيتم حذف كل موشرات هذا النمط. هل انت متأكد من حذف نمط المؤشر؟
es_es: Todos los marcadores para este tipo serán eliminados. Está seguro de eliminar este tipo de marcador?
fr: Tous les marqueurs de ce type seront perdus. Êtes-vous sûr de vouloir supprimer ce type de marqueur?
my: ယခုအမ်ိဳးအစား Marker အားလုံးကုိ ဆုံးရႈံးမည္ျဖစ္သည္။ ယခု Marker အား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Все маркеры данного типа будут утеряны. Вы действительно хотите удалить данный тип маркера?
th: ท่านยืนยันที่จะลบ Marker Type นี้หรือไม่ หากยืนยันMarker Type ที่ท่านเลือกนี้จะถูกลบทิ้งทั้งหมด

# MarkerTypeDeleted
source: Marker type was deleted successfully
ar: تم حذف نمط المؤشر
es_es: El tipo de marcador ha sido eliminado satisfactoriamente
fr: Type de marqueur supprimé
my: Marker အမ်ိဳးအစားအား ေအာင္ျမင္စြာ Delete လုပ္လုိက္ပါျပီ။
ru: Тип маркера был успешно удален
th: ลบ Marker Type นี้ สำเร็จ

# SelectMarkerType
source: Please select a marker type
ar: يرجى اختيار نمط المؤشر
es_es: Por favor, seleccione un tipo de marcador
fr: Sélectionner le type de marqueur
my: Marker အမ်ိဳးအစားတစ္ခုကုိ ေရြးခ်ယ္ပါ။
ru: Пожалуйста, выберите тип маркера
th: โปรดเลือก Marker Type

source: Marker type saved.
ar: تم حفظ نمط المؤشر
es_es: El tipo de marcador fue guardado.
fr: Type de marqueur enregistré
my: Marker အမ်ိဳးအစားကုိ Save လုပ္လုိက္ပါျပီ။
ru: Le type de marqueur a été acceptée.
th: บันทึก Marker Type

# InvalidDate
source: Date was entered is an incorrect format.
ar: نم ادخال التاريخ بصيغة غير صحيحة
es_es: El dato ingresado no tiene el formato correcto.
fr: La date a été saisie dans le mauvais format
my: ထည့္သြင္းထားေသာ ရက္စြဲသည္ မွန္ကန္မႈမရွိေသာ Format အမ်ိဳးအစားျဖစ္ေနသည္။
ru: Тип маркера сохранен
th: รูปแบบวันที่ไม่ถูกต้อง

# AssociatedDataWillBeLost
source: Associated data will be lost. Are you sure to delete selected factor?
ar: سيتم حذف كل البيانات المرتبطة بالعامل. هل أنت متأكد من حذف العامل المحدد؟
es_es: Los datos asociados serán eliminados. Está seguro que desea eliminar el factor seleccionado?
fr: Données associées seront perdues. Etes-vous sûr de supprimer le facteur sélectionné?
my: ပူးတြဲပါ Data မ်ားအားလုံးကုိ ဆုံးရႈံးမည္ျဖစ္သည္။ ယခုေရြးခ်ယ္ထားေသာ Factor အား Delete လုပ္ခ်င္သည္မွာ ေသခ်ာပါသလား။
ru: Введенная дата неправильного формата
th: ท่านต้องการที่จะลบ Factor นี้ใช่หรือไม่ ข้อมูลที่ Model ใช้Factor นี้จะสูญหายทั้งหมด

# FactorSavingError
source: Error saving factor
ar: خطأ في حفظ العامل
es_es: Error guardando el factor
fr: Erreur : facteur pas enregistré
my: Factor အား Save လုပ္ရာတြင္ Error တက္ေနသည္။
ru: Ошибка при сохранении фактора
th: บันทึก Factor ผิดพลาด(Error)

# ReorderFactorsSavedOk
source: Reordered factors have been saved correctly.
ar: تم حفظ الترتيب الجديد للعوامل
es_es: Los factores reordenados han sido guardados satisfactoriamente.
fr: Facteurs réorganisés enregistrés
my: မွတ္တမ္းတင္ထားေသာ Factor မ်ားအား မွန္ကန္စြာ Save လုပ္လိုက္ပါျပီ။
ru: Переупорядоченные факторы были сохранены верно
th: บันทึกการเรียงลำดับ Factor เรียบร้อยแล้ว

# EmptyField
source: One or more fields are not complete.
ar: لم يتم ملىء كافة الحقول
es_es: Uno o más campos no están completos.
fr: Un ou plusieurs champs ne sont pas complets
my: ကြက္လပ္တစ္ခု သုိ႔မဟုတ္ ကြက္လပ္မ်ားအား ျဖည့္စြက္ရန္ က်န္ရွိေသးသည္။
ru: Одно или несколько полей не заполнены
th: มีบาง Field ไม่สมบูรณ์

# NameHasBeenChanged
source: Name has been changed because there is another report with the same name
ar: نم تغيير الإسم لوجود تقرير آخر يحمل نفس الإسم
es_es: El nombre ha sido modificado porque existe otro reporte con el mismo nombre
fr: Le nom a été changé parce qu'il ya un autre rapport avec le même nom
my: အမည္တူ အျခား Report တစ္ခုရွိေနပါသျဖင့္္ ယခု Report ၏အမည္အား ေျပာင္းလဲထားပါသည္။
ru: Имя было изменено, так как отчет с таким именем уже существует
th: ชื่อ Report เปลี่ยนแปลงเนื่องจาก ซ้ำกับ Report เดิม

# LoadedCorrectlySettings
source: Settings have been correctly loaded.
ar: تم تحميل الإعدادات بشكل صحيح
es_es: La configuración ha sido satisfactoriamente cargada.
fr: Paramètres chargés
my: Setting မ်ားအား မွန္ကန္စြာ Load လုပ္လိုက္ပါျပီ။
ru: Настройки были правильно загружены
th: โหลด (Load)การตั้งค่า(Setting) ถูกต้อง

source: new regions have been imported.
ar: تم استيراد مناطق جديدة.
es_es: Nuevas regiones han sido importadas.
fr: Nouvelles régions importées
my: ေဒသအသစ္မ်ားအား Import ျပဳလုပ္ထားပါသည္။
ru: Импортированы новые регионы
th: นำเข้าแผนที่ใหม่สำเร็จแล้ว

# NoMarkerTypesDefined
source: There are no marker types defined. Go to marker type admin and define at least one marker type before placing a marker on the map.
ar: لم يتم تحديد المؤشر. يرجى الرجوع الى قائمة المؤشرات و تحديد مؤشر واحد على الأقل قبل اظافة المؤشر على الخريطة.
es_es: No hay tipos de marcadores definidos. Vaya a Administrar Tipo de Marcadores y defina al menos uno antes de ubicar un Marcador en el mapa.
fr: Les types de marqueurs ne sont définis. Aller vers administrateur et ensuite type de marqueur pour définir au moins un type avant de le mettre sur la carte.
my: Marker အမ်ိဳးအစားအား အဓိပၸါယ္ဖြင့္ဆုိထားျခင္း မရွိေသးပါ။ ေျမပုံေပၚ၌ Marker မတင္မီတြင္ Marker အမ်ိဳးအစားစီမံသည့္ ေနရာသုိ႔သြား၍ အနည္းဆုံး Marker တစ္ခုအား အဓိပၸါယ္ဖြင့္ဆုိပါ။
ru: Типы маркеров не определены. Пройдите в администратор типов маркеров и определите минимум один тип маркера прежде, чем крепить его к карте
th: ไม่ได้กำหนด Marker Type ใด ๆ ไว้ ขอให้ไปที่ Admin เพื่อกำหนด Marker Type อย่างน้อย 1 ชนิด ก่อนที่จะนำไปวางลงบนแผนที่
