Repository: InternationalIDEA/ERMT
Catalog: Idea.ERMT/Idea.Facade/General.*.resx
Languages: ar, es_es, fr, my, ru, th

# InvalidDateChoise
source: Date was entered is an incorrect format. Do you want to try again?
ar: نم ادخال التاريخ بصيغة غير صحيحة . هل تريد المحاولة مرة أخرى؟
es_es: Los datos ingresados no tienen un formato correcto. Desea intentarlo de nuevo?
fr: La date a été saisie dans le mauvais format. Veuillez essayer à nouveau
my: ထည့္သြင္းထားေသာ ရက္စြဲသည္ မွန္ကန္မႈမရွိေသာ Format အမ်ိဳးအစားျဖစ္ေနသည္။ ေနာက္တစ္ၾကိမ္ ျပန္လည္ထည့္သြင္းလုိပါသလား။
ru: Введенная дата неправильного формата. Хотите попробовать снова?
th: ป้อนวันที่ใหม่ เนื่องจากรูปแบบวันที่ไม่ถูกต้อง ท่านต้องการป้อนวันที่อีกครั้งหรือไม่

# TooManyColumns
source: Columns on pasted data are greater than expected.
ar: شبكة أعمدة البيانات الملصقة أكبر من الفضاء المتاح
es_es: Las columnas de los datos pegados son más de la cantidad esperada.
fr: Les colonnes sur les données collées sont plus nombreuses que prévu.
my: ထည့္သြင္းထားေသာ Data မ်ား၏ Column မ်ားသည္ ေမွ်ာ္မွန္းထားသည္ထက္ ပုိမုိၾကီးမားေနသည္။
ru: Стоблцы вставленных данных больше, чем ожидалось
th: ข้อมูลที่นำมาวางบนคอลัมน์ (Column) มากเกินไป ไม่ถูกต้อง

# DateEnteredIsNotFormattedCorrectly
source: The date entered is not formatted correctly.
ar: تم ادخال التاريخ بصيغة غير صحيحة
es_es: La fecha ingresada no tiene un formato correcto.
fr: La date indiquée n'est pas formatée correctement.
my: ထည့္သြင္းထားေသာ ရက္စြဲသည္ မွန္ကန္မႈမရွိေသာ Format အမ်ိဳးအစားျဖစ္ေနသည္။
ru: Введенная дата неправильно отформатирована
th: รูปแบบวันที่ไม่ถูกต้อง

# ShapeFilePathsNotFound
source: No paths were found on the selected file.
ar: لم يتم العثور على رابط في الملف المحدد
es_es: No fueron encontradas rutas en el archivo seleccionado.
fr: Aucun chemin n'a été trouvé dans le fichier sélectionné.
my: ေရြးခ်ယ္ထားေသာ File ထဲတြင္ Path တစ္ခုမွ မေတြ႕ပါ။
ru: Пути не были найдены для выбранного файла
th: หาเส้นทางสำหรับ File ที่กำหนดไม่พบ

# ShapeFileSymbolsNotFound
source: No symbols were found on the selected file.
ar: لم يتم العثور على رموز في الملف المحدد
es_es: Ningún símbolo fue encontrado en el archivo seleccionado.
fr: Aucun symbole n'a été trouvé dans le fichier sélectionné.
my: ေရြးခ်ယ္ထားေသာ File ထဲတြင္ Symbol တစ္ခုမွ မေတြ႕ပါ။
ru: Символы не были найдены для выбранного файла
th: หาสัญลักษณ์สำหรับFile ที่กำหนดไม่พบ

# DeleteTableRowConfirm
source: Are you sure you want to delete the selected row/s?
ar: هل أنت متأكد من حذف الأسطر المحددة ؟
es_es: Está seguro que desea eliminar la/s filas seleccionadas?
fr: Supprimer la ligne / s sélectionné?
my: ေရြးခ်ယ္ထားသည့္ Row မ်ားအား Delete လုပ္လုိသည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить выбранные ряд/ы?
th: ท่านแน่ใจที่จะลบข้อมูลแถวที่เลือกทิ้งทั้งหมดใช่หรือไม่

# ExportTables
source: Export tables to Excel
ar: تصدير الجداول الى ملف اكسيل
es_es: Exportar las tablas a Excel
fr: Exporter tableau vers Excel
my: ဇယားမ်ားအား Excel ဖုိင္အျဖစ္ Export ျပဳလုပ္ပါ။
ru: Экспортировать таблицы в Excel
th: ส่งข้อมูลออก (Export) ในรูปแบบ Excel

# ExportAllTables
source: All tables
ar: كل الجداول
es_es: Todas las tablas
fr: Tous les tableaux
my: ဇယားမ်ားအားလုံး
ru: Все таблицы
th: ทุกตารางข้อมูล (Table)

# ExportCurrentTable
source: Current table
ar: الجدول الحالي
es_es: Tabla actual
fr: Tableau actuel
my: လက္ရွိ ဇယား
ru: Текущая таблица
th: ตารางข้อมูล (Table) ที่ใช้งานปัจจุบัน

# IPChanged
source: Server address has been changed. Please restart the application for new settings to take effect.
ar: تم تغيير عنوان السورفر. يرجى إعادة فتح التطبيق لتحيين الإعدادات
es_es: La dirección del servidor ha sido modificada. Por favor, reinicie la aplicación para que los cambios tengan efecto.
fr: L'adresse du serveur a été modifiée. Redémarrer le logiciel pour que les nouveaux paramètres puissent entrer en vigueur.
my: Server address အသစ္ေျပာင္းလဲထားပါသည္။ Setting အသစ္မ်ား အသက္၀င္ေစရန္အတြက္ Application အား Restart ျပဳလုပ္ပါ။
ru: Адрес сервера был изменен. Пожалуйста, перезагрузите приложение для активизации новых настроек.
th: การเปลี่ยน Server address ต้อง Restart โปรแกรมใหม่อีกครั้ง

# UnableToSave
source: Unable to Save. The file is being used by another program.
ar: لم يتم الحفظ. الملف بقيد الاستعمال من برنامج آخر.
es_es: No se puede guardar. El archivo está siendo utilizado por otro programa.
fr: Impossible d'enregistrer. Le fichier est en utilisation par une autre application.
my: Save လုပ္၍မရပါ။ ယခု File အား အျခား Program တစ္ခုတြင္ အသုံးျပဳေနပါသည္။
ru: Невозможно сохранить. Файл используется другой программой.
th: ไม่สามารถบันทึกได้ เนื่องจากมีโปรแกรม (Program )อื่นใช้ File นี้อยู่

# FactorNameIsRequired
source: Factor name is required to save.
ar: إسم العامل ضروري لحفظ العامل.
es_es: El nombre del factor es requerido para guardar.
fr: Saisir le nom du facteur pour enregistrer.
my: Save လုပ္ရန္အတြက္ Factor အမည္ေပးရန္လုိအပ္သည္။
ru: Необходимо сохранить имя фактора
th: Factor ต้องได้รับการกำหนดชื่อก่อนการบันทึก

# FactorNameAlreadyExists
source: A factor whit the same name already exists. Please, choose another name.
ar: يوجد عامل يحمل نفس الإسم. يرجى إختيار إسم آخر.
es_es: Ya existe un factor con el mismo nombre. Por favor, elija un nuevo nombre.
fr: Un facteur avec le même nom existe déjà. Sélectionner un autre nom
my: အမည္တူျဖင့္ Factor တစ္ခု ရွိျပီးသားျဖစ္သည္။ အျခားအမည္တစ္ခု ေျပာင္းလဲေရြးခ်ယ္ေပးပါ။
ru: Фактор с таким именем уже существует. Пожалуйста, выберите другое имя.
th: มี Factor ชื่อซ้ำกัน โปรดเปลี่ยนชื่อ Factor ใหม่

# UserNameAlreadyExists
source: A user with the same username already exists. Please, choose another username.
ar: يوجد مستخدم يحمل نفس الإسم. يرجى إختيار إسم آخر.
es_es: Ya existe un usuario con el mismo nombre de usuario. Por favor, elija un nuevo nombre de usuario.
fr: Un utilisateur avec le même nom existe déjà. Sélectionner un autre nom d'utilisateur
my: အမည္တူျဖင့္ User တစ္ဥိး ရွိျပီးသားျဖစ္သည္။ အျခား Username တစ္ခု ေျပာင္းလဲေရြးခ်ယ္ေပးပါ။
ru: Пользователь с таким именем уже существует. Пожалуйста, выберите другое имя пользователя.
th: มี User ชื่อซ้ำกัน ให้ตั้งชื่อ Username ใหม่

# ValueNotValid
source: The value entered is not valid
ar: القيمة التي تم إدخالها ليست صالحة
es_es: El valor ingresado no es válido.
fr: La valeur saisie n'est pas valide
my: ထည့္သြင္းထားေသာ Value သည္ ခုိင္မာမႈမရွိပါ။
ru: Введенное значение недействительно
th: บันทึกค่าของข้อมูลไม่ถูกต้อง

# ConfirmDeleteMarkers
source: Are you sure you want to delete the selected markers?
ar: هل انت متأكد من حذف المؤشر؟
es_es: Está seguro que desea eliminar los marcadores seleccionados?
fr: Supprimer les marqueurs sélectionnés ?
my: ေရြးခ်ယ္ထားသည့္ Marker မ်ားအား Delete လုပ္လုိသည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить выбранные маркеры?
th: ท่านต้องการลบ Marker อันที่ท่านเลือกนี้ใช่หรือไม่

# ColumnCountNoMatch
source: Pasted column count does not match the table
ar: عدد الأعمدة الملصقة لا تتماشى مع الجدول
es_es: La cantidad de columnas pegadas no coincide con la de la tabla.
fr: La quantité de colonnes collées ne correspond pas à la table.
my: ထည့္သြင္းထားေသာ Column အေရအတြက္သည္ ဇယားႏွင့္ ကုိက္ညီမႈမရွိပါ။
ru: Вставленный счетчик столбцов не соответствует таблице
th: คอลัมน์(Column )ที่นำมาวางไม่สอดคล้องกับตารางข้อมูล (Table)

# PasswordChanged
source: Your password has been updated.
ar: تم تحيين كلمة السر.
es_es: Tu contraseña ha sido actualizada.
fr: Votre MdP a été mis à jour.
my: သင္၏ Password အား Update ျပဳလုပ္လုိက္ပါျပီ။
ru: Ваш пароль был обновлен
th: Password ของท่าน Update แล้ว

# PasswordChangedCaption
source: Change password
ar: تغيير كلمة السر
es_es: Modificar contraseña
fr: Changer MdP
my: Password ေျပာင္းမည္။
ru: Изменить пароль
th: เปลี่ยน Password

# PasswordEmpty
source: Passwords cannot be empty
ar: يجب ادخال كلمة سر
es_es: La contraseña no puede estar vacía.
fr: MdP ne peut pas être vide
my: Password ေနရာတြင္ ေဟာင္းေလာင္းထားလုိ႔ မရပါ။
ru: Пароли не могут быть пустыми
th: ไม่สามารถกำหนดให้ Password ว่างเปล่าได้

# PasswordNoMatch
source: Passwords do not match
ar: كلمات السر غير متطابقة
es_es: La contraseña no coincide
fr: Les MdP ne correspondent pas
my: Password မ်ား ကုိက္ညီမႈ မရွိပါ။
ru: Пароли не соответствуют
th: Password ไม่ถูกต้อง

# SelectARegionFirst
source: You must first select a region on the tree.
ar: يجب إختيار المنطقة من اللائحة أولا
es_es: Debe seleccionar una región del árbol.
fr: Sélectionner une région pour continuer
my: ဇယားပင္ေပၚတြင္ ေဒသတစ္ခုအား အရင္ေရြးခ်ယ္ရပါမည္။
ru: Сначала необходимо выбрать регион на дереве
th: ต้องเลือกแผนที่ที่ต้องการก่อน

# PasteUpTo200Rows
source: You can only paste up to 200 rows at a time.
ar: يمكن لصق الى حدود 200 سطر في مرة واحدة
es_es: Ustede puede solamente pegar un máximo de 200 filas de una sola vez.
fr: Vous ne pouvez coller jusqu'à 200 lignes à la fois.
my: တစ္ခါ Paste လုပ္လွ်င္ Row ၂၀၀ အထိသာ လုပ္ႏုိင္ပါသည္။
ru: Единовременно возможна вставка до 200 рядов
th: การคัดลอกข้อมูล (Paste) เพื่อนำมาวาง แต่ละครั้งทำได้ไม่เกิน 200 แถว

# PhaseSavedOk
source: Phase saved
ar: تم حفظ المرحلة الإنتخابية
es_es: Fase guardada
fr: Phase enregistré
my: Phase အား Save လုပ္လုိက္ပါျပီ။
ru: Фаза сохранена
th: ข้อความได้ถูกบันทึกแล้ว

# RiskAlertSaved
source: Risk Alert successfully saved.
ar: تم حفظ تنبيه الخطر
es_es: Risk Alert fue satisfactoriamente guardada.
fr: Alerte de risque enregistrée
my: Risk Alert အား ေအာင္ျမင္စြာ Save လုပ္လုိက္ပါျပီ။
ru: Предупреждение Риска успешно сохранено
th: บันทึก Risk Alert เรียบร้อยแล้ว

# DateFromHigherDateTo
source: Date from cannot be higher than date to
ar: تاريخ الانطلاق يجب ان يكون قبل تاريخ النهاية
es_es: La fecha desde no puede ser mayor a la fecha hasta
fr: Date à partir de doit être avant date jusqu'à
my: Date from သည္ Date to ထက္ ၾကီးမားေန၍ မရပါ။
ru: Дата от не может быть выше, чем дата до
th: วันที่เริ่มต้น (Date from) ต้องมีค่าน้อยกว่า วันที่สิ้นสุด(Date to)

# PastePleaseInsertARowFirst
source: Please add a row before paste.
ar: يرجى إظافة سطر قبل الإلصاق
es_es: Por favor, agregue una fila antes de pegar.
fr: Ajouter une ligne avant de coller
my: Paste မလုပ္မီတြင္ Row တစ္ခုအား အရင္ Add လုပ္ပါ။
ru: Пожалуйста, добавьте ряд перед вставкой
th: ต้องเพิ่มแถวข้อมูลก่อนที่จะนำข้อมูลที่ถูกคัดลอกมาวาง (Paste)

# DeleteDocumentDialogTitle
source: Select the document to be deleted
ar: الرجاء تحديد الملف المراد حذفه
es_es: Seleccione el documento a ser eliminado
fr: Sélectionner le document à supprimer
my: Delete လုပ္မည့္အရာအား ေရြးခ်ယ္ပါ။
ru: Выберите документ для удаления
th: เลือกเอกสารที่ต้องการจะลบ(Delete)

# DeleteDocumentUseDefaultDirectory
source: Please select a file from the initial directory displayed in the Open File Dialog.
ar: الرجاء تحديد ملف من من اللائحة المعروضة ضمن خيار الملفات
es_es: Por favor, seleccione el archivo desde el directorio inicial mostrado en la ventana de abrir archivo.
fr: Sélectionner un fichier à ouvrir dans le répertoire affiché.
my: Open File Dialog တြင္ ျပသထားသည့္ File မ်ားထဲမွ တစ္ခုအားေရြးခ်ယ္ပါ။
ru: Пожалуйста, выберите файл из первоначального каталога, показанного в Диалоговом окне Открыть Файл
th: โปรดเลือก File จาก Directory ที่แสดงใน Open File Dialog

# DeleteDocumentWarning
source: The selected document will be permanently deleted. Any links using it will have to be manually updated. Do you want to continue?
ar: سيتم حذف الملف المختار. يجب تحيين كل الروابط المرتبطة به. هل تريد المواصلة ؟
es_es: El documento seleccionado será borrado permanentemente. Algunos links utilizados deberán ser manualemente actualizados. Desea continuar?
fr: Le document sélectionné sera supprimé. Tous les liens qui l'utilisent doivent être mis à jour manuellement. Continuer ?
my: ယခုေရြးခ်ယ္ထားေသာ အရာအား အျပီးသတ္ Delete လုပ္ေတာ့မည္ျဖစ္သည္။ ၎အရာႏွင့္ ဆက္စပ္ေနသည့္ Link မ်ားအားလုံးကုိ Manual နည္းျဖင့္ Update ျပဳလုပ္ရမည္ျဖစ္သည္။ ဆက္လက္ေဆာင္ရြက္လုိပါသလား။
ru: Выбранный документ будет окончательно удален. Все использующие его ссылки должны быть обновлены вручную. Хотите продолжить?
th: คำเตือน "เอกสารที่เลือกจะถูกลบโดยถาวร การเชื่อมโยง (Link) ใดๆที่มีต่อเอกสารนี้จะต้องทำโดย Manual เท่านั้น" ท่านต้องการดำเนินการต่อหรือไม่

# DocumentExistsAlready
source: A file with the name you specified already exists.\n Do you want to replace it?
ar: الإسم المقترح مستعمل من قبل ملف . هل تريد استبداله؟
es_es: Ya existe un archivo con el nombre especificado. Desea reemplazarlo?
fr: Un fichier avec le nom sélectionné existe déjà. \n Voulez-vous le remplacer?
my: သင္ယခုေရြးခ်ယ္ထားေသာ အမည္ႏွင့္ အမည္တူ File တစ္ခုရွိျပီးသားျဖစ္သည္။ အဆုိပါ File အား ယခု File ျဖင့္ အစားထုိးလုိပါသလား။
ru: Файл с таким именем уже существует. Хотите его заменить?
th: ชื่อ File ที่ท่านกำหนด ซ้ำกับ ชื่อ File ที่มีอยู่แล้ว ท่านต้องการแทนที่ File เดิมหรือไม่

# DocumentSuccessfullyDeleted
source: The document was successfully deleted.
ar: تم حذف المستند
es_es: El documento ha sido eliminado satisfactoriamente
fr: Document supprimé
my: ယခုအေၾကာင္းအရာအား ေအာင္ျမင္စြာ Delete လုပ္ျပီးသြားပါျပီ။
ru: Документ был успешно удален
th: ลบ (Delete)เอกสารเรียบร้อยแล้ว

# RestoreAsAdministratorWarning
source: In order to restore the database, the application needs to run with Administrator privileges. An application restart is required. Do you want to continue?
ar: لإستعادة قاعدة البيانات، يجب استخدام امتيازات المسؤؤل لتشغيل التطبيق . يجب إعادة تشغيل التطبيق. هل تريد الاستمرار؟
es_es: Para restaurar la base de datos, la aplicación debe estar corriendo con privilegios de administrador. Es necesario reiniciar la aplicación. Desea continuar?
fr: Pour restaurer la base de données, le logiciel doit exécuter avec des privilèges d'administrateur. Un redémarrage est nécessaire. Continuer?
my: Database အား Restore ျပဳလုပ္ရန္အတြက္ Application အား Administrator Privileges ျဖင့္ ဖြင့္ရန္လုိအပ္သည္။ Application အား Restart ျပဳလုပ္ရန္လည္းလိုအပ္သည္။ ဆက္လက္ေဆာင္ရြက္ လုိပါသလား။
ru: Чтобы восстановить базу данных необходимо перезагрузить работу с приложением как Администратор. Хотите продолжить?
th: การกู้คืนข้อมูล (Database Restore) จะต้องได้รับสิทธิ จาก Admin

# RestoreTimeWarning
source: Restore might take a few minutes. Click OK to continue.
ar: تتطلب عملية الإستعادة بعض الدقائق. اضغط موافق للإستمرار
es_es: La restauración tomará unos pocos minutos. Clickee OK para continuar.
fr: Cette opération peut prendre quelques minutes. Cliquez OK pour continuer.
my: Restore ျပဳလုပ္မႈသည္ မိနစ္အနည္းငယ္ခန္႔ ၾကာျမင့္မည္ျဖစ္သည္။ ဆက္လက္ေဆာင္ရြက္လုိပါက OK ခလုပ္ကုိႏႈိပ္ပါ။
ru: Восстановление может занять несколько минут. Нажмите ОК для продолжения.
th: การกู้คืน (Restore) อาจใช้เวลาสักครู่ กด OK เพื่อดำเนินการต่อไป

# LatitudeLongitudeFormatError
source: Latitude and longitude must be decimal values.
ar: يجب ان تحتوي خطوط الطول و العرض على قيمة عشرية
es_es: La latitud y longitud deben tener valores decimales.
fr: La latitude et la longitude doivent être des valeurs décimales.
my: Latitude ႏွင့္ Longitude မ်ားသည္ Decimal Value မ်ား ျဖစ္ရပါမည္။
ru: Широта и долгота должны быть десятичными значениями
th: เส้นรุ้ง (Latitude) และเส้นแวง(Longitude) จะต้องมีค่าเป็นจุดทศนิยม

# ConfirmDeleteMarkerTypeImage
source: Do you want to delete the image associated to the marker type?
ar: هل تريد حذف الصورة المرتبطة بالمؤشر
es_es: Desea eliminar la imagen asociada a el tipo de marcador?
fr: Supprimer l'image associée à ce type de marqueur ?
my: Marker အမ်ိဳးအစားႏွင့္ ပူးတဲြေနသည့္ပုံအား Delete လုပ္လုိပါသလား။
ru: Хотите удалить картинку, связанную с типом маркера?
th: ท่านต้องการลบรูปที่ Marker Type ใช้งานอยู่หรือไม่

source: Information
ar: معلومات
es_es: Información
my: သတင္းအခ်က္အလက္
ru: Информация
th: ข้อมูลข่าวสาร

source: Warning
ar: تحذير
es_es: Cuidado
fr: Attention
my: သတိေပးခ်က္
ru: Предупреждение
th: คำเตือน โปรดระมัดระวัง

source: No
ar: لا
my: မလုပ္လိုပါ။ (No)
ru: Нет
th: ไม่ใช่ (No)

source: Skip
ar: مرور
es_es: Saltar
fr: Sauter
my: ေက်ာ္လုိက္ပါ။ (Skip)
ru: Пропустить
th: เลื่อนไป (Skip)

source: Yes
ar: نعم
es_es: Sí
fr: Oui
my: လုပ္လုိသည္။ (Yes)
ru: Да
th: ใช่ (Yes)

# LoginFailed
source: Username and/or password are incorrect.
ar: خطأ في اسم المستخدم أ/و كلمة السر
es_es: El nombre de usuario o la contraseña son incorrectos.
fr: Nom d'utilisateur et/ou MdP sont incorrects.
my: Username ႏွင့္/ သုိ႔မဟုတ္ Password တုိ႔ မွန္ကန္မႈမရွိပါ။
ru: Имя пользователя и/или пароль неправильны
th: Username หรือ Password ไม่ถูกต้อง

source: Back
ar: رجوع
es_es: Atrás
fr: Arrière
my: ေနာက္ျပန္သြားမည္။ (Back)
ru: Вернуться
th: ย้อนกลับ (Back)

source: Forward
ar: تابع
es_es: Adelante
fr: Avant
my: ေရွ႕ဆက္သြားမည္။ (Forward)
ru: Продолжить
th: ไปข้างหน้า (Forward)

source: Print
ar: طباعة
es_es: Imprimir
fr: Imprimer
my: Print ထုတ္မည္။
ru: Печать
th: พิมพ์ (Print)

# PhaseBulletDelete
source: Are you sure you want to delete the selected bullet?
ar: هل انت متأكد من حذف العمود؟
es_es: Está seguro que desea eliminar la marca seleccionada?
fr: Supprimer les bullets points sélectionnés ?
my: ယခု Select လုပ္ထားေသာ အခ်က္မ်ားအား Delete လုပ္လုိသည္မွာ ေသခ်ာပါသလား။
ru: Вы уверены, что хотите удалить выбранные символы?
th: ท่านต้องการลบปุ่ม (Bullet) ที่เลือกใช่หรือไม่

# FactorNameRequired
source: Factor Name cannot be null or empty.
ar: يجب ملئ حقل اسم العامل
es_es: El nombre del factor no puede ser nulo o estar vacío.
fr: Nom de facteur ne peut pas être vide
my: Factor Name ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Имя фактора не может быть нулевым или пустым
th: ต้องตั้งชื่อให้ Factor ด้วย ห้ามปล่อยวางไว้

# UserModifyTitle
source: User modify
ar: تعديل مستخدم
es_es: Modificar usuario
fr: Utilisateur modifier
my: User မွ Modify ျပဳလုပ္မည္။
ru: Изменение Пользователя
th: การแก้ไข User

source: Version
ar: نسخة
es_es: Versión
my: မူကြဲ (Version)
ru: Версия
th: เวอร์ชั่น (Version)

# FactorInterval
source: Interval must be greater than zero.
ar: القيمة يجب أن تكون اكبر من صفر
es_es: El intervalo debe ser mayor a cero
fr: Intervalle doit être supérieur à zéro.
my: Interval သည္ သုညထက္ ပုိရမည္။
ru: Интервал должен быть больше,чем ноль
th: ช่วง (Interval) ต้องมีค่ามากกว่า 0

# FactorScaleMax
source: Scale Max must be greater than Scale Min.
ar: الحد الأعلى يجب أن يكون أكبر من الحد الأدنى
es_es: La escala máxima debe ser mayor que la escala mínima.
fr: Echelle max doit être supérieure à l'échelle min.
my: Scale Max သည္ Scale Min ထက္ပုိရမည္။
ru: Шкала Максимум должна быть больше Шкалы Минимум
th: Max ต้องมีค่ามากกว่า Min

# FactorScaleMin
source: Scale Min must be greater than zero.
ar: الحد الأدنى يجب أن يكون أكبر من صفر
es_es: La escala mínima debe ser mayor a cero.
fr: Echelle min doit être supérieure à zéro.
my: Scale Min သည္ သုညထက္ပုိရမည္။
ru: Шкала Минимум должна быть больше нуля
th: Min ต้องมีค่ามากกว่า 0

# NameEmptyUserManager
source: Factor Name cannot be null or empty.
ar: يجب ملئ حقل اسم العامل
es_es: El nombre del factor no puede estar nulo o vacío.
fr: Nom de facteur ne peut pas être vide
my: Factor Name ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Имя фактора не может быть нулевым или пустым
th: ต้องตั้งชื่อให้ Factor ด้วย ห้ามปล่อยวางไว้

source: Add new factor
ar: اظافة عامل
es_es: Agregar Nuevo Factor
fr: Ajouter nouveau facteur
my: Factor အသစ္ထည့္မည္။
ru: Добавить новый фактор
th: เพิ่ม Factor

source: Add new user
ar: اظافة مستخدم جديد
es_es: Agregar Nuevo Ususario
fr: Ajouter nouvel utilisateur
my: User အသစ္ထည့္မည္။
ru: Добавить нового пользователя
th: เพิ่ม User

# DocumentSelectAdd
source: Select a document to add.
ar: اختر المستند للاظافة
es_es: Seleccione un documento para agregar.
fr: Sélectionner le document à ajouter
my: ထည့္သြင္းရန္ စာရြက္စာတမ္းတစ္ခု ေရြးခ်ယ္ပါ။
ru: Выбрать документ для вставки
th: เลือกเอกสารที่ต้องการจะเพิ่ม

# ElectoralCycleBulletText
source: Please insert a valid Bullet Text
ar: يرجى ادخال نص صحيح في العمود
es_es: Por favor, inserte un texto para la marca
fr: Insérer du texte valide
my: ခုိင္မာေသာ အခ်က္အား ျဖည့္စြက္ပါ။
ru: Пожалуйста, вставьте действительный пункт
th: โปรดใส่ข้อความปุ่ม (Bullet) ให้ถูกต้อง

# EmailCannotEmpty
source: Email cannot be null or empty.
ar: يجب ملئ حقل الايميل
es_es: El email no puede estar nulo o vacío.
fr: Email ne peut pas être vide
my: အီးေမးလ္လိပ္စာေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Электронная почта не может быть нулевой или пустой
th: ต้องใส่ชื่อ Email ห้ามปล่อยว่างไว้

source: Message not found
ar: الرسالة غير موجودة
es_es: Mensaje no encontrado.
fr: Message pas trouvé
my: အခ်က္အလက္ မေတြ႕ရွိပါ။
ru: Сообщение не найдено
th: ไม่พบข้อความที่ต้องการ

source: Modify Factor
ar: تعديل عامل
es_es: Modificar Factor
fr: Modifier facteur
my: Factor အား Modify ျပဳလုပ္မည္။
ru: Изменить Фактор
th: แก้ไข ปัจจัย (Factor)

source: Modify Phase
ar: تعديل مرحلة انتخابية
es_es: Modificar Fase
fr: Modifier phase
my: Phase အား Modify ျပဳလုပ္မည္။
ru: Изменить Фазу
th: แก้ไข ข้อความ (Phase)

# PasswordCannotEmpty
source: Password cannot be null or empty.
ar: يجب ملئ حقل كلمة السر
es_es: La contraseña no puede estar nula o vacía.
fr: MdP ne peut pas être vide
my: Password ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Пароль не может быть нулевым или пустым
th: ไม่ได้ใส่ Password

source: Phase Bullet
ar: بخصوص المرحلة الإنتخابية
es_es: Marca de Fase
fr: Bullet points de la phase
ru: Фаза Пункта
th: ข้อความประกาศ (Bullet)

source: Reorder factors
ar: إعادة ترتيب العوامل
es_es: Reordenar Factores
fr: Réorganiser les facteurs
my: Factor မ်ားအား အစဥ္လုိက္ျပန္စီပါ။
ru: Упорядочить факторы
th: เรียงลำดับ Factor

# SelectRole
source: Please select a Role.
ar: يرجى اختيار الدور
es_es: Por favor, seleccione un rol.
fr: Sélectionner un rôle
my: Role တစ္ခုအား Select လုပ္ပါ။
ru: Пожалуйста, выберить Роль.
th: โปรดเลือกหน้าที่ (Role)

# UserCannotEmpty
source: Username cannot be null or empty.
ar: يجب ملئ حقل اسم المستخدم
es_es: El nombre de usuario no puede estar nulo o vacío.
fr: Nom d'utilisateur ne peut pas être vide
my: Username ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Имя пользователя не может быть нулевым или пустым.
th: ไม่ได้ใส่ Username

# UserLastNameEmpty
source: Last name cannot be null or empty.
ar: يجب ملىئ حقل اللقب العائلي
es_es: El apellido no puede estar nulo o vacío.
fr: Nom ne peut pas être vide
my: Last Name ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Фамилия не может буть нулевой или пустой.
th: ไม่ได้ใส่ Last Name

# UserNameEmpty
source: Name cannot be null or empty.
ar: يجب ملىئ حقل الإسم
es_es: El nombre no puede estar nulo o vacío.
fr: Prénom ne peut pas être vide
my: အမည္ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Имя не может быть нулевым или пустым.
th: ไม่ได้ใส่ Name

# WarningAddDocument
source: Warning adding document.
ar: تحذير اظافة مستندات
es_es: Cuidado, agregando documento.
fr: Attention ajoutant document
my: စာရြက္စာတမ္းအသစ္ ထည့္သြင္းေၾကာင္း သတိေပးသည္။
ru: Предупреждение перед добавлением документа.
th: คำเตือน การเพิ่มเอกสาร

# CodeSixCaracters
source: Code must be of only 6 characters.
ar: يجب أن يتكون الكود من ستة رموز فقط
es_es: El código debe ser de solamente 6 caracteres.
fr: Code ne peut contenir que 6 caractères
my: Code တြင္ စာလုံးေရ ၆ လုံးသာ ပါ၀င္ရမည္။
ru: Кодировка должна состоять только из 6 знаков
th: Code ต้องมีเพียง 6 ตัวอักษร

# PhaseCannotEmpty
source: Phase title cannot be null or empty.
ar: يجب ملىئ حقل المرحلة الإنتخابية
es_es: El título de fase no puede estar nulo o vacío.
fr: Nom de phase ne peut pas être vide
my: Phase Title ေနရာအား အလြတ္ထားထား၍ မရပါ။
ru: Название Фазы не может быть нулевым или пустым
th: Phase Title ห้ามปล่อยว่างไว้

# ServerTitle
source: Enter server hostname or IP address
ar: يرجى ادخال اسم السورفر أو العنوان IP
es_es: Ingresar el hostname del servidor o la dirección IP.
fr: Saisir le nom d'hôte du serveur ou l'adresse IP
my: Server Hostname သုိ႔မဟုတ္ IP Address အား ျဖည့္သြင္းပါ။
ru: Вставьте имя хоста сервера или IP адрес
th: ใส่ Server Hostname หรือ IP Address

# UserValidateEmail
source: Email is required.
ar: الايميل ضروري
es_es: El email es requerido.
fr: Adresse email nécessaire
my: အီးေမးလ္လိပ္စာ လုိအပ္သည္။
ru: Необходимо ввести Электронную почту
th: ต้องใส่ชื่อ Email

# UserValidateFirstName
source: First name is required.
ar: الاسم ضروري
es_es: El nombre es requerido.
fr: Prénom nécessaire
my: First Name လုိအပ္သည္။
ru: Необходимо имя
th: ต้องใส่ชื่อ First Name
